[
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=14572",
    "Name":"Tori Ashley",
    "Email":"Horsegirl901(at)aol.com",
    "Website":"Phone:  434-962-9471",
    "Phone_no":"434-962-9471",
    "Address":"Afton,VA 22920",
    "Contact_person":"No contact Person",
    "Details":"I am a certified Equine and K9 massage therapist, here to assist in the relieving equine and K9 muscle soreness so the animals can perform at their best. This is not a substitute for veterinary care, however it is a therapy that aids in the animals overall performance and feeling. \n\nEquines are $100 a massage and K9s are $50 a massage. When traveling farther than an hour from the Charlottesville area a fee may be added or multiple horses may be required to make the trip."
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=14593",
    "Name":"The Roaming Equestrian",
    "Email":"Lesliettrimble(at)gmail.com",
    "Website":"https:\/\/lesliettrimble.wixsite.com\/theroamingequestrian",
    "Phone_no":"",
    "Address":"[MAP]307 college laneAlderson,",
    "Contact_person":"Leslie Trimble",
    "Details":"Leave your home, farm, and\/or pets with a trusted caretaker! With over 10 years experience farm and Pet Sitting and over 20 working with horses and animals I have the skills, knowledge, and compassion to care for your animals while you are away. \n\nOffering short and long term on site farm sitting. I offer care of livestock, horses, and domestic pets alongside basic farm chores, household chores, and gardening.\n​\nPrice is calculated based on number of animals, chores, and detail of care. I work with you to set a per day price based on your needs."
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=14584",
    "Name":"NOVA Equestrian Center",
    "Email":"novaeqc(at)gmail.com",
    "Website":"http:\/\/www.novaeqc.comPhone:  7039885001",
    "Phone_no":"7039885001",
    "Address":"[MAP]24556 James Monroe HwyAldie,",
    "Contact_person":"NOVA Equestrian Center",
    "Details":"For top performance and wellness-centered training, join us at the NOVA Equestrian Center! \n\nWe are the ONLY Equestrian Center in the region to have a fitness and rehab center co-located on the property... and we go above and beyond just sharing the property - we INCLUDE water treadmill sessions (with solarium and 3D vibrating floor) in our TRAINING BOARD PROGRAMS!\n\nIt's the best well-rounded training program available and we've designed our programs to benefit EVERY RIDDEN HORSE, regardless of fitness level and discipline.\n\nCome take a tour and see our newly updated facility and amenities. We can't wait to show you around.\n\nEmail us info@novaeqc.com for more information and to schedule a tour!"
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=11849",
    "Name":"Certified Equine Massage",
    "Email":"magraha79(at)gmail.com",
    "Website":"",
    "Phone_no":"",
    "Address":"Alexandria,VA 22305",
    "Contact_person":"No contact Person",
    "Details":"I am a certified equine massage therapist, specializing in deep tissue sports massage, that is not only beneficial to the equine athlete, but horses of any age or condition. \n\nSome of the benefits of massage include:\n\n* Increased circulation\n* Improved range of motion\n* Increase in production of synovial fluid to the joints\n* Decrease in muscle tension and pain\n\nRates:\n\n- $45.00 per horse (full-body massage usually lasts around one hour)\n\n- $10.00 travel fee outside of 25 mile radius\n\nPlease contact me for more information, rates or to schedule an appointment!"
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=12469",
    "Name":"EquiYogi",
    "Email":"equiyogi(at)gmail.com",
    "Website":"",
    "Phone_no":"",
    "Address":"Alexandria,VA 22303",
    "Contact_person":"No contact Person",
    "Details":"www.EquiYogi.com is a website dedicated to adding positive awareness and balance to your riding by combining aspects of yoga and equestrianism. Subscribe for free weekly tips and suggestions on becoming a healthier, happier you, and a better partner for your horse."
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=12817",
    "Name":"Lacy Laubacher Massage Therapy",
    "Email":"info(at)lacylaubacher.com",
    "Website":"http:\/\/www.lacylaubacher.com\/Phone:  9105818476",
    "Phone_no":"9105818476",
    "Address":"Alexandria,VA 22301",
    "Contact_person":"No contact Person",
    "Details":"As a horse and human massage therapist, I work with trainers\/riders\/owners to bring out the best performance in both horse and rider. I am an experienced competitor-just in the world of rodeo-but I understand the demands of competition and the athletic life. That's why I keep it simple, effective, and comprehensive. I am happy to provide in between session support, barn rates, clinics, and video support."
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=12239",
    "Name":"UnCommon Touch",
    "Email":"ingrdo(at)gmail.com",
    "Website":"http:\/\/www.uncommontouch.info Phone:  540-316-8034",
    "Phone_no":"Phone540-316-8034",
    "Address":"[MAP]742 South Poes RoadAmissville,",
    "Contact_person":"Ingrid Oliphant",
    "Details":"The work I do with animals and humans is very similar.  I work intuitively, sometimes with a focus on a particular issueinjury, illness, emotions.  Other times, I just get out of the way and let the energy work its magic.  There is no modality or methodology.  I just bring a Gift that effects mind, body and spirit in miraculous ways. \n\nA key difference when working with animals is communication.  Humans, generally speaking, have a pretty good grasp of what's going on with them and can share verbally. With horses and other four-legged friends, things are a little different.  Human companions can share with me a veterinarian's diagnosis or describe symptoms. Sometimes they are right but, again, generally speaking, that's not the entire picture.  So, when working with animals I listen.  I'm not an animal communicator' in the sense that most people presume one to be.  I just listen' with all of my senses and allow an animal's response to me and the energy guide how I move and breathe.  \n\nThere are those who attempt to explain how the energy works.  The truth is, no one knows.  In my case, the only thing I know is that it does work. It works on dramatically shortening recovery time after acute injury; elimination of chronic injury and illness; emotional & physical trauma; behavioral issues for which no one else has found solutions.  I can't explain it and don't go looking for the how or why.  I just watch lame and wild horses transform into healthy, happy, active creatures.  I see paralyzed pooches wag, walk and otherwise be hale and hearty.\n\nThe fee for animal work (including distance healing) is $85 for one hour.\n\nFor testimonials, please go to: http:\/\/www.uncommontouch.info\/UnCommonTouch.com\/Animal_Work.html"
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=14621",
    "Name":"Wings of Hope Ranch",
    "Email":"admin(at)wingsofhoperanch.org",
    "Website":"http:\/\/www.wingsofhoperanch.orgPhone:  804-485-4045",
    "Phone_no":"804-485-4045",
    "Address":"Ashland,VA 23005",
    "Contact_person":"No contact Person",
    "Details":"Wings of Hope Ranch is a Christian ministry where rescued horses and children come together to find hope and healing. The ranch is located in western Hanover, VA. Volunteers, supporters and ministry partners wanted! Learn more at www.wingsofhoperanch.org"
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=12426",
    "Name":"Pinecrest Stables",
    "Email":"Pinecrest_stables(at)yahoo.com",
    "Website":"http:\/\/Www.pinecreststables.weebly.comPhone:  276-226-0766",
    "Phone_no":"276-226-0766",
    "Address":"[MAP]869 Muddy Fork RdBassett,",
    "Contact_person":"Leah Metz-Hylton",
    "Details":"Full service equestrian facility located on almost 1300 acres. We host events all yr long in our large lit outdoor arena & round pen. From competitive or pleasure riding we offer lessons & instruction for both you and your horse in a safe & fun atmosphere. 4-H, gymhkhana, trail, competitive trail riding,  hunter under saddle, western pleasure, western performance, saddleseat, walking & racking.  Beginners to advanced. Clinics, day camps, birthday parties, pony rides, guided trail rides, training, transportation, boarding, breeding of high quality appaloosas & performance quarter horses, equine & tack sales. Certified instructor & licensed vet tech on site 24 hrs. Family atmosphere, let us help u with your equestrian needs!"
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=14671",
    "Name":"LG Performance Horses LLC and Therapy",
    "Email":"lazygfarms12(at)gmail.com",
    "Website":"http:\/\/Facebook.com\/LazyGFarmsTrainingPhone:  5404922365",
    "Phone_no":"5404922365",
    "Address":"Bedford ,VA 24523",
    "Contact_person":"No contact Person",
    "Details":"Certified Equine Sports Massage Therapist \nOther Therapy Modalities available tailored specifically to your horses needs."
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=13964",
    "Name":"Appleseed Veterinary Group",
    "Email":"drlow(at)appleseedvet.com",
    "Website":"http:\/\/www.appleseedvet.comPhone:  540-230-0655",
    "Phone_no":"540-230-0655",
    "Address":"Blacksburg,VA 24060",
    "Contact_person":"No contact Person",
    "Details":"My name is Dr. Sarah Low. I am a licensed veterinarian in the state of Virginia and a certified Veterinary Medical Acupuncturist offering equine acupuncture, massage, myofascial release, gentle musculoskeletal manipulations and other related techniques.  I support positive, successful horse-human partnerships and life-long learning for all equestrian disciplines.  Please see my website or call me at 540-230-0655 for more information.  www.appleseedvet.com"
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=12568",
    "Name":"Kimberly E. Cathell, Certified Equine Sports Massage Therapy & Farm\/Pet Sitting",
    "Email":"whiteraven33(at)hotmail.com",
    "Website":"http:\/\/kec-equinesportsmassagetherapy.webs.com\/Phone:  757-665-5181",
    "Phone_no":"757-665-5181",
    "Address":"[MAP]PO Box 502Bloxom,",
    "Contact_person":"Kimberly Cathell",
    "Details":"Massage:  Every equine, be it the High-Performance Athlete or the Family Horse is a candidate that can benefit from Sports Masssage Therapy.  This therapy can be used as a preventative tool as well as a corrective one.\n\nI now offer pet\/farm sitting also!  Each farm is unique and requires different types of care. I am prepared to work with you on a tailored package best suited for you and your farm.\n\nServices can include:\n         Scheduled Feeding and Fresh Water Given \n         Turn Out Routines Kept \n         Water and Feed Buckets Cleaned \n         Stalls Picked \n         Paddocks Picked Up"
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=13450",
    "Name":"Classic Touch Equines",
    "Email":"ctequines(at)gmail.com",
    "Website":"Phone:  703-581-7555",
    "Phone_no":"703-581-7555",
    "Address":"[MAP]12201 Cedarville RdBrandywine,",
    "Contact_person":"Ali Shepard",
    "Details":"CT Equines has openings for Board, Lessons, and Training! Working student and boarder positions also available. Barn features 12x14 fully matted stalls, tack room, hot\/cold wash stall, and large additional storage space. Horses are turned out in small groups in grass fields. Dry lots and individual turnout are also available. On our 100 acre farm, boarders can enjoy the 80 x 200 indoor sand arena with mirrors, outdoor dressage arena, outdoor grass jumping field, round pen, access to 5\/8 mile bluestone track, pond, and indoor bathrooms.\n\nWarm, welcoming boarders, with a mix of disciplines. Trails also stem out from the property and we are just down the road from Cedarville State Park. Lessons and training are offered on site.  CTE strives to meet each horse and owner's individual needs to ensure that each horse is healthy, happy, and sound.\n\nBoard also includes daily handling, fly mask\/blanketing\/bandaging, basic wound care, holding for appointments, and contact with boarders about any changes in health or behavior of their horse. Full Board is $600 a month. Special boarding packages are offered to include lessons, training, and bodywork, as well as extra care."
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=13607",
    "Name":"Erin Pearson",
    "Email":"Erin(at)erinpearson.org",
    "Website":"Phone:  540-987-9507",
    "Phone_no":"540-987-9507",
    "Address":"[MAP]88 Scrabble RoadCastleton,",
    "Contact_person":"Erin Pearson",
    "Details":"Founder rehabilitation and trimming education. Natural beef and lamb, chickens. Livestock guardian dogs occasionally for sale.Hypnosis and healing for humans also."
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=12022",
    "Name":"Dandelion Fields",
    "Email":"Erin(at)dandelionfields.biz",
    "Website":"http:\/\/www.dandelionfields.bizPhone:  540-987-9507",
    "Phone_no":"540-987-9507",
    "Address":"[MAP]88 Scrabble RoadCastleton,",
    "Contact_person":"Erin Pearson",
    "Details":"Dandelion Fields is an Animal Health and Wellness business.  Horse, dog, cat and all other animals.  I carry Dynamite Specialty Products and do Natural Trim\/founder rehabilitation, treat EPM, Lyme, Cushings, allergies, behavioral issues. I do Reiki, Bach Flower mixes and consultations for health and behavioral issues.  I train horses and dogs also."
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=11652",
    "Name":"Dandelion Fields",
    "Email":"Erin(at)dandelionfields.biz",
    "Website":"http:\/\/www.dandelionfields.bizPhone:  540-987-9507",
    "Phone_no":"540-987-9507",
    "Address":"[MAP]88 Scrabble RoadCastleton,",
    "Contact_person":"Erin Pearson",
    "Details":"Dandelion Fields is a Horse Health and Wellness facility and service.  Providing Training, Rehabilitation, Natural Trim, Reiki, Emotional Healing with Bach Flower, Homeopathics and Love.  Consultation in Nutritional Plans for Horses, animals and people. \n  **Specializing in the special needs cases in training and healing.  Also Preventive Health and Wellness.  Healthy, sound and Stable Horses and Ponies for sale also."
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=11541",
    "Name":"Cavalry Ridge Stables",
    "Email":"Presuslady(at)aol.com",
    "Website":"Phone:  703-283-6544",
    "Phone_no":"703-283-6544",
    "Address":"[MAP]4015 Sanders LnCatharpin,",
    "Contact_person":"Kristin Moore",
    "Details":"Boarding available at Cavalry Ridge Stables!  Full care with 12x12 stall $650 (blanketing included).  Field board $375 (blanketing included).  Large indoor manufactured sand ring with lights, jumps, barrels, etc.  Outside wash pad.  Lots of acreage with mares and geldings separated 5 huge fields with streams.  Minutes from the battlefield.  Retirees welcome.  Horse must be current on coggins and up to date on shots\/wormer\/fecal (parasite) test.  Numerous Vets\/Farriers frequent CRS.  Vet Tech on staff and is there most days.  Equine Sports Massage Therapist also on staff (see FB page Equine Massage Unlimited)  Please contact us for further details.  Find us on FB at Cavalry Ridge Stables."
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=10966",
    "Name":"Flying Change Therapy - Psychotherapy\/Coaching for Horse-Sport Related Trauma",
    "Email":"vickikirsch(at)hotmail.com",
    "Website":"http:\/\/therapists.psychologytoday.com\/40939 Phone:  617-306-7417",
    "Phone_no":"Phone617-306-7417",
    "Address":"[MAP]4400 University Drive, Fairfax, VA Centreville & Williamsburg,",
    "Contact_person":"Vicki Kirsch",
    "Details":"Offices in Fairfax & Williamsburg. Have you had a fall off of your horse or had a horse-related experience from which you currently experience fear, stiffness, and\/or anxiety? Would you like to experience your earlier joy, energy flow, and connection with your equine partner? I have a distinct focus working with equestrians who currently experience fear, anxiety, and stiffness in their riding and wish to recover their earlier vitality, flow and joy. With the help of techniques which dissipate your mind\/body trauma response and mindfulness, I help riders achieve their goals. I am a Licensed Social Worker in Northern Virginia who is also a horse owner and dressage enthusiast -- give me a call or email me. Sliding Scale Available. http:\/\/therapists.psychologytoday.com\/40939"
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=14521",
    "Name":"Happier Pony Equine Massage, LLC",
    "Email":"catlneedham(at)happierponyllc.com",
    "Website":"https:\/\/www.happierponyllc.com\/Phone:  703 593 8797",
    "Phone_no":"7035938797",
    "Address":"Chantilly,VA 20151",
    "Contact_person":"No contact Person",
    "Details":"Equissage-Certified massage for the NOVA area. $65\/hr. Contact me to get a Happier Pony! Massage is a proven methodology to help horses perform better, improve mobility, optimize blood flow if sedentary, and assist their stress if on stall rest. Have horses who help in professional therapy or lesson programs? I offer a small discount. \n\nCheck out my massage at Lift Me Up! Therapy Riding Center, where I try to donate a free massage several times a year. \nhttps:\/\/youtu.be\/MGu9qreodF4"
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=12144",
    "Name":"Mane-ly Muscles: Equine Sports Massage",
    "Email":"info(at)manelymuscles.com",
    "Website":"http:\/\/www.manelymuscles.comPhone:  802-558-5139",
    "Phone_no":"802-558-5139",
    "Address":"[MAP]Cove TraceCharlottesville,",
    "Contact_person":"Ashley  Holden",
    "Details":"Professional, experienced Equine Sports Massage & Reiki Therapy. Serving the greater Charlottesville area."
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=11883",
    "Name":"Dominion Equine Massage",
    "Email":"lec3y(at)virginia.edu",
    "Website":"http:\/\/www.dominionequine.comPhone:  (434) 249-3446",
    "Phone_no":"(434)249-3446",
    "Address":"Charlottesville,VA 22903",
    "Contact_person":"No contact Person",
    "Details":"Dominion Equine Massage offers sports massage for horses in Charlottesville and the surrounding areas. Massage is an excellent way to improve your horse's performance and disposition. Please visit dominionequine.com for rates and more information."
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=14136",
    "Name":"FPF EQUINE MUSCLE INTEGRATION THERAPY",
    "Email":"FivePenceFarm(at)gmail.com",
    "Website":"Phone:  804-363-6817",
    "Phone_no":"804-363-6817",
    "Address":"Chatham,VA 22541",
    "Contact_person":"No contact Person",
    "Details":"EQUINE SPORTS MASSAGE THERAPY\n\nAllow your Horse to Enhance their Emotional and Physical Being, reaching Maximum​ Potential through Proper Body Muscle manipulation, Non Invasive Curative Therapy and Maintenance Programs.\nAny Horse, Any Discipline,Any Level will reap benefits from Equine Muscle Integration Therapy. \n\n\nContact to inquire information, rates or to schedule an appointment."
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=12249",
    "Name":"KJ Massage",
    "Email":"",
    "Website":"No website link",
    "Phone_no":"No Pone number",
    "Address":"Chesapeake,VA 23323",
    "Contact_person":"No contact Person",
    "Details":"No Details"
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=14693",
    "Name":"RT Equine - Bodywork and Saddle Fitting Services",
    "Email":"Rachel(at)rtequine.com",
    "Website":"Phone:  757-206-3765",
    "Phone_no":"757-206-3765",
    "Address":"Chesterfield,VA 23832",
    "Contact_person":"No contact Person",
    "Details":"Equine bodywork and saddle fitting services in central Virginia!\n\nRachel Toquothty is a Masterson Method Certified Practitioner and saddle fitter. With her knowledge of anatomy, bodywork and saddle fitting, Rachel is able to provide an individualized approach to help each horse reach their full potential.\n\nWhat is the Masterson Method? \n\nThe Masterson Method is an integrated and unique method of equine bodywork that works WITH the horse instead of ON the horse. These techniques help release tension in core muscles and in the muscles of key junctions of the body that affect the horse's performance. \n\nWhether your horse is retired or a top tier athlete, every horse can benefit from the Masterson Method!"
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=14014",
    "Name":"NC Integrated Equine Services, LLC",
    "Email":"nikki.charltonies(at)gmail.com",
    "Website":"Phone:  5405225480",
    "Phone_no":"5405225480",
    "Address":"[MAP]2056 Birch DrCulpeper,",
    "Contact_person":"Nichole Charlton",
    "Details":"Equine Sports Massage and Physical Therapy."
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=14324",
    "Name":"North Star Stables",
    "Email":"northstarstablesnova(at)gmail.com",
    "Website":"http:\/\/northstarstablesnova.orgPhone:  540-7170-121",
    "Phone_no":"540-7170-121",
    "Address":"[MAP]4092 Rolling Hills DriveDelaplane,",
    "Contact_person":"Teresa Pilegaard",
    "Details":"North Star is an inclusive equestrian facility, offering both therapeutic riding and able-bodied riding lessons under the same roof. We teach in the classical tradition with an emphasis on the health and well-being of the horse.\n\n\nLocated just outside of Marshall in gorgeous Delaplane, we offer riding lessons and equine assisted activities and therapies for ages 3 and older."
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=12207",
    "Name":"Best Saddle Solutions",
    "Email":"",
    "Website":"No website link",
    "Phone_no":"No Pone number",
    "Address":"Fairfax,VA 22031",
    "Contact_person":"No contact Person",
    "Details":"No Details"
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=12160",
    "Name":"Bella Massage",
    "Email":"belladonna989(at)live.com",
    "Website":"http:\/\/www.belladonna massage.netPhone:  214-952-6898",
    "Phone_no":"massage.netPhone214-952-6898",
    "Address":"[MAP]11733 Fairfax Woods WAY Apt 6106Fairfax ,",
    "Contact_person":"Joanne Mirabella",
    "Details":"Massage Therapy for Equines and Humans \n  Sports Medicine for Athletes..\nI am a licensed Massage Therapist in Virginina,Texas and Florida\n   Therapies for Dressage and Jumpers,Hunters and Carraige horses.\n I work in Myofacial release,Structural Intergration,and Rolfing..\n   Worked with Joann Wilson in the Wilson -Meagher Technics..\n   In my Human practice I worked in a chiropractic clinic for pain management in low back pain,neck and shoulder injury...\n  Tens units,hydroculator hydrotherapy and ultrasound...  call me for your evaluation  horse and rider combination....Joanne Mirabella 214-952-6898\nwww.belladonna massage.net"
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=14488",
    "Name":"Zen Equine Sports Massage",
    "Email":"kjherrity(at)gmail.com",
    "Website":"",
    "Phone_no":"",
    "Address":"Fairfax Station,VA 22039",
    "Contact_person":"No contact Person",
    "Details":"Equine Sports Massage in Northern VA! Certified through Equissage. I love horses and can't wait to help your pony feel better with Sports Massage! My rate is $75 for a 1-hour massage and $260 for 4 massages($65 per)."
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=13434",
    "Name":"Virginia Equine Therapy Solutions",
    "Email":"beckytubb(at)gmail.com",
    "Website":"http:\/\/www.equinetherapysolutions.comPhone:  5405701262",
    "Phone_no":"5405701262",
    "Address":"[MAP]1455 Brownsburg tpkFairfield,",
    "Contact_person":"Becky Tubb",
    "Details":"Equine rehabilitation center, specializing in massage, laser, vibration & other non invasive therapies.\nOur priority is reconditioning after injury\/surgery, post show soreness & assisting in long term care."
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=12061",
    "Name":"Brook Hill Farm",
    "Email":"executivedirector(at)brookhillfarm.org",
    "Website":"http:\/\/www.brookhillfarm.orgPhone:  540-586-7432",
    "Phone_no":"540-586-7432",
    "Address":"[MAP]7289 Bellevue RoadForest,",
    "Contact_person":"Jo Anne  Miller",
    "Details":"Brook Hill Farm, a non-profit horse rescue organization, exists to provide rehabilitation focused services and safe haven for unwanted horses, while maintaining a unique opportunity for personal growth and education for area youth and adults. Since its inception in 2001, the farm has taken in 361 lame horses, rehabilitated them, and given them away for free to qualified homes. Along the way, Brook Hill discovered the magic of the combination of horses and teens; how they help youth who are at-risk develop life skills enabling them to have success in school. Brook Hill Farm provides college credit to interns in many fields of study, and works with other area organizations to provide education on horse care and the plight of the unwanted horse."
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=13955",
    "Name":"Brook Hill Farm",
    "Email":"executivedirector(at)brookhillfarm.org",
    "Website":"Phone:  540-586-7432",
    "Phone_no":"540-586-7432",
    "Address":"[MAP]7289 Bellevue RoadForest,",
    "Contact_person":"Jo Anne  Miller",
    "Details":"Brook Hill Farm is a non-profit organization specializing in horse rescue and rehabilitation, fully accredited by the Global Federation of Animal Sanctuaries and the Thoroughbred Aftercare Alliance.  The Farm runs a PATH Therapeutic Riding program for people with disabilities, and an equine assisted learning program for At-risk youth with the goal of completing high school. The farm also offers college credit for college students.  Please visit www.brookhillfarm.org for more information."
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=14325",
    "Name":"Alogo Equine Massage",
    "Email":"info(at)alogomassage.com",
    "Website":"http:\/\/www.alogomassage.comPhone:  540-272-2891",
    "Phone_no":"540-272-2891",
    "Address":"Fredericksburg,VA 22",
    "Contact_person":"No contact Person",
    "Details":"Help your horse\/pony reach their full potential with a equine sports massage."
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=14449",
    "Name":"Olde Towne Equine, Veterinary and Chiropractic",
    "Email":"katemoga(at)gmail.com",
    "Website":"http:\/\/www.oldetowneequine.comPhone:  5402393122",
    "Phone_no":"5402393122",
    "Address":"[MAP]211 Fauquier StFredericksburg,",
    "Contact_person":"kate moga",
    "Details":"OTE provides veterinary and chiropractic care to horses in the counties surrounding Fredericksburg including S. Fauquier, Caroline, King George, Stafford and Spotsylvania. Canine chiropractic available on your farm."
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=14377",
    "Name":"Alogo Equine Massage",
    "Email":"hmeadows83(at)gmail.com",
    "Website":"http:\/\/www.alogomassage.comPhone:  540-272-2891",
    "Phone_no":"540-272-2891",
    "Address":"Fredericksburg,VA 22405",
    "Contact_person":"No contact Person",
    "Details":"Is your horse performing at their best? Want that extra edge? Try equine massage therapy.\nThe benefits of equine massage therapy are expansive, including the following:\nHelps to Prevent Injury – As you exercise your horse, you are building up his muscle. This is done when many small tears are made in the muscle fibers during exercise, which are then repaired with scar tissue over the next couple days. Massage helps to break down the scar tissue, allowing muscles to be elastic and flexible.\nImproves Circulation – Massage dilates blood vessels and increases blood flow to the area. Increased circulation can help speed recovery of injured muscle tissues and restore mobility.\nIncrease Range of Motion – Between stretching tissues, improving muscle tone and lowering stiffness and swelling, equine massage therapy can expand a horse's range of motion, allowing them to become more effective under saddle.\nReduces Stress – Horses experience stress and anxiety just like we do, and massage relaxes them just as it does us. When muscles are rubbed, there is a sedative effect on the nervous system, which helps with relaxation and can improve disposition.\nCall Alogo Equine Massage for all your massage needs.\nKatie Bromley (540)272-2891\nOffer multi horse discounts"
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=12324",
    "Name":"Equinity - Equine Therapy & Activities",
    "Email":"Mystic(at)Equinity.org",
    "Website":"Phone:  540.412.8255",
    "Phone_no":"540.412.8255",
    "Address":"Fredericksburg,VA 22407",
    "Contact_person":"No contact Person",
    "Details":"Equinity is proud to announce the launch of our NEW Equine-Assisted Growth & Development program in the Spotsylvania, Fredericksburg, and Stafford areas! Program participants will learn the basics of horsemanship such as grooming, handling, equine healthcare, training from the ground, training under saddle, and even stable chores, while developing essential traits such as confidence, assertiveness, communication and relationship skills, and responsibility. \n\nEquinity exists to improve the quality of life of underprivileged and at-risk youth through equine-assisted activities and equine-assisted psychotherapy.\n\nParticipation in this program is FREE!!!! Contact Mystic for more information and to enroll your child in our program!"
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=12363",
    "Name":"Kneaded Relief, LLC",
    "Email":"brandipendleton(at)hotmail.com",
    "Website":"http:\/\/www.brandipendletoncmt.comPhone:  540.538.2286",
    "Phone_no":"540.538.2286",
    "Address":"[MAP]3219 Fall Hill AveFredericksburg,",
    "Contact_person":"Brandi Pendleton",
    "Details":"I offer massage for the rider! Help improve your riding by relaxing the muscles that help connect you to your horse. Specializing in Ashiatsu Oriental Bar Massage, Sports Massage and Deep Tissue Massage. Each massage is tailored to your needs, no cookie cutter massage here! Contact me to find out about my specials."
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=11672",
    "Name":"Battlefield Park Polo Club",
    "Email":"delorab(at)hotmail.com",
    "Website":"http:\/\/www.battlefieldparkpolo.comPhone:  239-989-2011",
    "Phone_no":"239-989-2011",
    "Address":"[MAP]5704 Pageland LaneGainesville,",
    "Contact_person":"Dori  Burner",
    "Details":"Battlefield Park Polo Club is a United States Polo Association recognized club and is multi-use facility which offers a wide range of services to fulfill your equestrian needs, polo, jumping, and dressage are taught here. \n\nBattlefield Park Polo is located just 2 miles off I-66 at exit 43B in Gainesville and we are just across the street from the historic Manassas Battlefield where there are miles of trails.  \n\nWe have recently completed construction on a large outdoor arena 120' x 200', an indoor arena 75' x 150' with 10 attached stalls and a 400 sq. ft.  lounge\/tack\/viewing area.  We have another new 10 stall barn with tack and feed room, and a new guest house.  We have 25 acres of turnout available for our 18 school horses.\n\nBattlefield Park offers a wide range of services: Riding Lessons in all Disciplines, Polo Lessons, Summer Camp, Green\/Problem Horse Training, Farrier, Transportation, Boarding,  Pony Club Activities, Trail Riding, Tack Sales, Horse Sales, Horse Leasing, Event Services such as Pony Parties, Weddings, and Corporate Polo Parties and Trail Rides.\n\nWe offer USPA Interscholastic and Intercollegiate Polo Programs.\n\nWe have clients of all ages who can come to Battlefield Park Polo to learn how to ride and enjoy horses. We have exceptionally low prices and make horses accessible to everyone!  Come out and have some fun!"
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=14604",
    "Name":"MagnaWaveRVA",
    "Email":"magnawaverva(at)gmail.com",
    "Website":"http:\/\/www.magnawaverva.comPhone:  8049806815",
    "Phone_no":"8049806815",
    "Address":"GLEN ALLEN,VA 23059",
    "Contact_person":"No contact Person",
    "Details":"www.magnawaverva.com\n\nAre you looking for PEMF (pulsed electromagnetic field therapy) for your horses, riders or beloved farm dogs?  Look no further.  I am located in Western Henrico County near Goochland and available to travel to your farm or home for treatment sessions.  PEMF has dozens of benefits including pain reduction, inflammation reduction, circulation increase and detox.  Please check out the website to educate yourself on this wellness therapy with NO DOWNTIME and very few contraindications for use."
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=14583",
    "Name":"AMH Equestrian",
    "Email":"Amh.89(at)icloud.com",
    "Website":"http:\/\/www.amhequestrian.comPhone:  804-955-6240",
    "Phone_no":"804-955-6240",
    "Address":"Glen Allen,VA 23060",
    "Contact_person":"No contact Person",
    "Details":"I am a certified life coach and e coach. I work with individuals to heal patterns of trauma, overcome unconscious patterns and trigger points, and deepen their relationship with s and others. \n\nI also work with riders and horses who have anxiety, fear, or a mental block after a fall or other fearful event."
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=14379",
    "Name":"Deux Gris Performance Therapy",
    "Email":"deuxgris11(at)gmail.com",
    "Website":"https:\/\/www.facebook.com\/deuxgrisperformance\/",
    "Phone_no":"",
    "Address":"Grottoes,VA 24441",
    "Contact_person":"No contact Person",
    "Details":"Deux Gris Performance Therapy offers a personalized approach to your horse's athletic development. Michaela Bragg is a certified equine sports massage therapist and professional rider\/trainer. She brings the perspective she has gained from riding in the hunter\/jumper\/equitation rings to her therapy techniques, which has proven beneficial to her clients. \n\n\n\nThe integration of massage into your horse's training program may help alleviate muscle pains, reduce inflammation, expedite healing, improve demeanor, and allow for a more regenerative recovery period after a big event.\n\n\n\nHelp your athlete bloom this spring and summer with Deux Gris Performance Therapy! Contact Michaela to learn more about her techniques, pricing, and sponsorship opportunities! Visit and Like our Facebook page for testimonials and other news! \n\n\n\n*Equine massage therapy is NOT intended to replace any veterinary treatment. If your horse displays symptoms of an injury or illness, contact your veterinarian immediately."
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=12338",
    "Name":"Reiki Healing\/Medium",
    "Email":"lighthealn(at)yahoo.com",
    "Website":"Phone:  540-209-1071",
    "Phone_no":"540-209-1071",
    "Address":"[MAP]920 OaklandHarrisonburg,",
    "Contact_person":"Denise Farley",
    "Details":"I do Reiki healing and communication.I also do distance healing and communication.If you would like distance work done you can mail a photo of the animal to me, this helps me connect with the animal better. All distance work is by donation.If you would like me to come out it would be $25 for an hour.I may need to charge additional $ if the travel is far.I also connect with the other side if you have an animal that has crossed over and would like to communicate with them."
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=14474",
    "Name":"JLT Equine Massage & Saddle Fitting",
    "Email":"JLT111293(at)gmail.com",
    "Website":"http:\/\/https:\/\/jltequinemassagesaddlefitting.wordpress.com\/Phone:  540- 424-3032",
    "Phone_no":"540-424-3032",
    "Address":"[MAP]2142 Venable Road Kents store,",
    "Contact_person":"Joanna  Torreyson",
    "Details":"Better weather is just around the corner!  JLT Equine Massage & Saddle Fitting is proudly located in Kents Store, VA and works with all breeds and all disciplines of riding. \n\nJoanna Torreyson is certified in Equine Massage therapy and Saddle Fitting from the university of South Carolina through the Aiken program. As a rider herself, she knows how important it is to make sure that the saddle fits not only the horse but also the rider and how a correctly fitted saddle can lead to a happier partnership.  \n\nJust like humans, horses get sore and need a massage after a hard day of work.  Let your horse relax with Joanna and see just how much of a difference it makes in your trail or show partner. See your horse's overall personality change for the better! Make your appointment today! \n\nAll breeds and Disciplines welcomed."
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=10768",
    "Name":"Dragonfly Farms",
    "Email":"Katherine(at)DragonflyFarms.com",
    "Website":"http:\/\/https:\/\/dragonflyhorse.farmPhone:  804.916.9696",
    "Phone_no":"804.916.9696",
    "Address":"[MAP]264 Springdale DrKeswick,",
    "Contact_person":"Katherine Burke",
    "Details":"Veterinarian owned and operated retirement and lay-up facility.  \n2 locations - \nKeswick, VA and Louisa, VA\nHigh quality retirement and lay-up board."
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=11659",
    "Name":"Total Equine Veterinary Associates (Drs Jay Joyce and Sallie Hyman)",
    "Email":"info(at)totalequinevets.com",
    "Website":"http:\/\/www.totalequinevets.comPhone:  703 505 2320",
    "Phone_no":"7035052320",
    "Address":"Leesburg,VA 20176",
    "Contact_person":"No contact Person",
    "Details":"Complete equine veterinary and dental services.\n24\/7 Emergency coverage. Specialists.\nDigital rads, lameness eval, pre-purchase exams.\nComprehensive Wellness Programs.\nGreat team. Great practice."
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=14240",
    "Name":"Compassionate Animal Communication",
    "Email":"holli(at)compassionspeaks.com",
    "Website":"www.CompassionSpeaks.comPhone:  703-447-5374",
    "Phone_no":"703-447-5374",
    "Address":"Leesburg,VA 20176",
    "Contact_person":"No contact Person",
    "Details":"I am an Animal Communication Counselor. I help people who are having an issue with their animals (destructive or otherwise) so they can understand why and how to help resolve the issue. I also work with people who want to check in with their animal companions as well. \n\nPlease feel free to visit my website: CompassionSpeaks.com or contact me for more information."
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=12416",
    "Name":"Hands on Horses, LLC",
    "Email":"handsonhorsesllc(at)gmail.com",
    "Website":"Phone:  (757) 604-1400",
    "Phone_no":"(757)604-1400",
    "Address":"[MAP]PO Box 365Lightfoot,",
    "Contact_person":"Angela Hirose",
    "Details":"Equine sports massage therapy has many benefits, including:\n- Enhances muscle tone and range of motion.\n- Reduces inflammation and swelling in the joints, thereby alleviating pain.\n- Promotes the healing process by increasing the flow of nutrients to the muscles, and aiding in carrying away excessive fluids and toxins.\n- Creates a positive effect on the contractual and release process of the muscles...releasing tension...relaxing muscles.\n- Stimulates circulation by: defrosting frozen muscles, thereby releasing endorphins - the body's natural pain killers.\n- Helps to maintain the whole body in better physical condition\n\nI am an experienced rider and horse owner, and have been trained and certified by Equissage. Please call me to see how massage can help your horse!"
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=12273",
    "Name":"4 Star Equine Performance Therapy",
    "Email":"rideondowntoit(at)gmail.com",
    "Website":"http:\/\/www.jasstables.comPhone:  540-905-3933",
    "Phone_no":"540-905-3933",
    "Address":"[MAP]P.O. Box 158Lincoln,",
    "Contact_person":"Katie Davis",
    "Details":"4 Star Equine Performance Therapy, is based out of JAS Stables Eventing's training facility in Purcellville, VA. Katie is looking to accommodate you! If you're looking to increase circulation, relieve tension, enhance flexibility, and improve the performance and disposition of your horse then sports massage is for you! Katie is available to travel to you whether it be for pre-event, post-event, training support, or just a great gift for your equine partner. All disciplines welcome! \"Four-Star is the highest level of performance in Three Day Eventing. I want every owner and horses partnership, in any discipline, to feel like a Four Star Performance!\" Katie Davis, is a certified equine sports massage therapist as well as an upper level eventer. It runs in the family! While her mother and sister are both human deep tissue massage specialists, Katie thought it was time for an equine one. While operating her own training business and competing at high levels of performance, Katie realizes that a tense muscle is not a well performing muscle. And much like a chain reaction, when one muscle is tense other muscles tend to follow suit. To perform well we have to feel great! Passionate about horses and wanting her horses to peak in performance, Katie became board certified through Mary Schreiber's renowned EQUISSAGE program. Seeing the amazing improvement (with massage) in performance and attitude with her own horses, Katie created 4 Star Equine Performance Therapy!"
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=11178",
    "Name":"The Natural Farrier",
    "Email":"Shannondoa(at)hotmail.com",
    "Website":"http:\/\/www.NaturalFarrier.com Phone:  1-434-906-3607",
    "Phone_no":"Phone1-434-906-3607",
    "Address":"[MAP]1584 Kents Mill RdLouisa,",
    "Contact_person":"Shannon Carner",
    "Details":"www.NaturalFarrier.com \n\nFind us on Facebook, search \"The Natural Farrier\" \n\n Natural Hoof Trimming:\n    Not just another trim- I am a degreed podiatrist, helping your horses put a better hoof forward. I can help your horse overcome chronic lameness, underrun heels and more. If you think your horses hooves don't look good, you're probably right.\"  Get better hooves TODAY! \n\n\nHi, my name is Shannon Carner, DAEP (degreed equine Podiatrist)and I am a natural hoof care practitioner and offer an array of services including:\n\nRubber horseshoes-\n    A GREAT asset to horses that need a lighter shoe. Dramatically reduces strain on tendons and joints. Helps with arthritic horses, navicular and most lameness issues. Can be nailed on, glued on, or used with Equisocks. \n\nEquisocks Natural Hoof Wear:\n    Looks like vetwrap, activates in water, and forms a 'boot' that lasts for up to 5 weeks! Great for founder, sore feet or to secure a loose shoe!\n\n Visit my website: \n\nwww.NaturalFarrier.com or Facebook \"The Natural Farrier\" I offer FREE hoofcare videos, advice and more! \nLearn more at www.NaturalFarrier.com \n\nCall today, and learn more at www.CarnerEquinePodiatry .com"
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=14456",
    "Name":"JLT Equine Massage & Saddle Fitting",
    "Email":"JLT111293(at)gmail.com",
    "Website":"https:\/\/jltequinemassagesaddlefitting.wordpress.com\/Phone:  540- 424-3032",
    "Phone_no":"540-424-3032",
    "Address":"[MAP]1658 Evergreen RdLouisa,",
    "Contact_person":"Joanna  Torreyson",
    "Details":"Joanna Torreyson is certified in Equine Massage therapy and Saddle Fitting from the university of South Carolina through the Aiken program. As a rider herself, she knows how important it is to make sure that the saddle fits not only the horse but also the rider and how a correctly fitted saddle can lead to a happier partnership. \n\nJust like humans, horses get sore and need a massage after a hard day of work.  Let your horse relax with Joanna and see just how much of a difference it makes in your trail or show partner. See your horse's overall personality change for the better! \n\n All breeds and Disciplines welcomed"
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=14424",
    "Name":"JLT Equine Massage & Saddle fitting",
    "Email":"JLT111293(at)gmail.com",
    "Website":"https:\/\/jltequinemassagesaddlefitting.wordpress.com\/Phone:  540- 424-3032",
    "Phone_no":"540-424-3032",
    "Address":"[MAP]2317 Evergreen RdLouisa ,",
    "Contact_person":"Joanna  Torreyson",
    "Details":"Joanna Torreyson is certified in Equine Massage therapy and Saddle Fitting from the university of South Carolina through the Aiken program. As a rider herself, she knows how important it is to make sure that the saddle fits not only the horse but also the rider and how a correctly fitted saddle can lead to a happier partnership. \n\nJust like humans, horses get sore and need a massage after a hard day of work.  Let your horse relax with Joanna and see just how much of a difference it makes in your trail or show partner. See your horse's overall personality change for the better!\n Make your appointment today! \n\nAll breeds and Disciplines welcomed."
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=14396",
    "Name":"JUST PULSE IT",
    "Email":"klsplinter(at)aol.com",
    "Website":"https:\/\/www.facebook.com\/karen.l.gagliano\/Phone:  865-466-7646",
    "Phone_no":"865-466-7646",
    "Address":"[MAP]13570 Breezy Meadow LaneLovettsville,",
    "Contact_person":"Karen Splinter-Gagliano",
    "Details":"Pulsed Electromagnetic Therapy (PEMF) For Horses, People and Pets\n\n\t\n\nKaren Splinter-Gagliano (JUST PULSE IT)\nLovettsville, VA\nklsplinter@aol.com\n865-466-7646\n\nBenefits of PEMF Therapy for Horses, People and Pets......\n\nIMPROVE PERFORMANCE\nIncrease Speed, Strength, Relaxation, Suppleness & Range of Motion\n\nRELIEVE PAIN\nReduce Inflammation, Stiffness and Soreness, Penetrate Deeper than Laser or Massage, Reduce Stress\/Tension\n\nDETECT AREAS OF SORENESS\nHelp Detect WHERE you horse is Sore & Relieve the Soreness\n\nREDUCE RECOVERY TIME\nGet Back to Fitness up to 70% Faster\n\nHEAL FASTER\nAccelerate Healing Time from Wounds, Soft Tissue Injuries, Fractures, Illness, etc.\n\nBOOST HEALTH & ENERGY\nPEMF works on a variety of conditions involving soft tissue, bone, hooves, illness, age-related issues and more!\n\nDRUG FREE THERAPY\nAt the show....before and\/or after competition.....for injury or illness....At home for maintenance.\n\nJust Pulse It\nKaren Gagliano, Certified PEMF Practitioner\nCall for appointment and information: 865-466-7646\n13570 Breezy Meadow Lane\nLovettsville, VA 20180\n\nJustpulseit@gmail.com\n\nSearch FB for Just Pulse It at:\nhttps:\/\/www.facebook.com\/karen.l.gagliano\/\n\nAsk about demos at your barn and package discounts\n\n\n\nPlease use the following link to find out more about PEMF Therapy for horses, people and pets:\n\nhttps:\/\/documentcloud.adobe.com\/link\/track?uri=urn%3Aaaid%3Ascds%3AUS%3A2c44c02c-a926-402c-b295-a08559d5bd4f\n\nI am available to service the Northern VA, WV, and MD areas."
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=14588",
    "Name":"Kinetic Balance",
    "Email":"",
    "Website":"No website link",
    "Phone_no":"No Pone number",
    "Address":"Lovettsville,VA 20180",
    "Contact_person":"No contact Person",
    "Details":"No Details"
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=14546",
    "Name":"EquiHeart Yoga LLC",
    "Email":"alison(at)equiheartyoga.com",
    "Website":"https:\/\/www.equiheartyoga.comPhone:  7038530359",
    "Phone_no":"7038530359",
    "Address":"[MAP]3638 Oak Park RdMadison,",
    "Contact_person":"Alison Curtis",
    "Details":"Yoga for Equestrians\nI use the tools of yoga and rider biomechanics to help riders find the balance between effort and ease, strength and suppleness and find harmony with their horse to aid them in becoming better more relaxed riders.\n\nMy Offerings:\n-In-Person On the mat group classes as several barns in Central Virginia\n-In-Person Private yoga sessions on the mat and on your horse\n-Online Classes, Courses and Programs\n-Workshops and Clinics\n\nPlease visit my website to see my schedule and register for classes and private sessions and sign-up for my newsletter to learn more about the benefits of yoga for your riding and to keep up to date with any special offers. \nNamaste"
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=12533",
    "Name":"Graywood Riding - Lessons, Boarding, Theraputic Riding",
    "Email":"Graywood_Riding(at)yahoo.com",
    "Website":"Phone:  540-219-1466",
    "Phone_no":"540-219-1466",
    "Address":"Madison,VA 22727",
    "Contact_person":"No contact Person",
    "Details":"Graywood is a riding barn, located near the tri-county corner of Culpeper, Madison, & Orange!  25 beautiful acres with miles of riding trails and an 8-stall barn.  The riding ring is 200x120 with stone dust & sand footing and equipped with nice jumps.  There is also a small round pen for ground work.\n\n\nGraywood is a family friendly farm that is happy to accommodate riders and horse lovers of all ages and experience levels (group and privet lessons).  We are able to do theraputic riding classes as well (privet lessons only).  We believe in creating a safe and fun environment where everyone is encouraged to be the best they can be.\n\n\nGraywood offers privet & group lessons 7 days a week as well as horse boarding.  Denise makes farm calls if you are local or she'll drive long distance with gas & time reimbursement. \n\n\nLessons: English hunters & Western Pleasure and Barrels\n    - $25 for half hour privet lesson (per person)\n    - $25 for hour semi-privet (2 riders, $25 each)\n    *ride our schooling ponies or trailer your own*\n\n\n\nOwner & Instructor is Denise Lynch.  Denise has over 30 years experience teaching, training, and showing.  She moved to Madison County 17 years ago and has coached many winning riders over the years.  Denise has a BS degree in Equestrian Studies from Salem College and Meredith Manor.  She's shown A circuit, local hunters, and trained race horses.  Denise's teaching includes riding and horse knowledge (hippology).\n\n\nIf you live in Madison County, your child can ride the bus to the farm after school for their lesson.  Parent's can pick their children up after the lesson (good after school care option).\n\n\nBoarding:\n-$350 per month stall board, includes: hay, water, feed, turn out, & feet picking daily.  (Extra care available for an extra fee, contact for pricing)\n    - 3 large fields\n    - 8 stalls\n    - 2 run-in sheds\n    - 25 acres\n\n\n\nFor more information or to schedule you first lesson please respond to Graywood_Riding@yahoo.com with \"riding lessons\" in the subject box.  Be sure to include your phone number so we can give you a call back.\n\nWe look forward to hearing from yall!"
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=13095",
    "Name":"The Healing Touch",
    "Email":"mustangrdr(at)att.net",
    "Website":"Phone:  609-502-6723",
    "Phone_no":"609-502-6723",
    "Address":"Madison,VA 22727",
    "Contact_person":"No contact Person",
    "Details":"Having trouble achieving the perfect ride?  Does your horse struggle with lead changes? Behavior problems (Bucking, rearing, striking, etc.) stiffness or soreness?  Call me today about how to fix these \"vices\" and create a better relationship with your horse.    \n\nSPRING SPECIAL-->  Receive $25 off your first session!!  \n\nCertified Equine Sports Massage Therapist, Reiki Master, and Certified Master Saddle Fitter. I am a 20 YEAR VETERAN in the field of alternative therapies.   \n\nThe Healing Touch has moved into the Central VA region after servicing the mid Atlantic for over 20 years! I offer only the best in alternative therapies.  Trained and certified by Don Doran School of Equine Massage, The Healing Touch (est. 1995)  offers services for every equine, whether a fierce top level competitor or weekend trail rider, your horse will benefit! \n\nServices Offered Include: Equine, Canine, and Human Massage, Reiki Master (energy healing), Accupressure, Magnetic Therapy, Moxibustion, Homeopathic remedies, Sport Taping, Therapeutic Stretching, Gait Analysis, and Master Saddle Fitting.   \n\nCall for details, additional information, and to schedule your first session!\n\nOffering Services in the following counties:\nCulpeper\nMadison\nGreene\nOrange\nFaquier *$15 Fuel Charge\nSpotsylvania  *$15 Fuel Charge\nRappahanock  *$15 Fuel Charge\nPrince William  *$15 Fuel Charge\nStafford  *$15 Fuel Charge\nPage  *$15 Fuel Charge\nAbelmarle\nFluvana  *$15 Fuel Charge"
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=12328",
    "Name":"Healing Touch for Animals",
    "Email":"NoVA(at)healingtouchforanimals.com",
    "Website":"http:\/\/www.healingtouchforanimals.comPhone:  7035686294",
    "Phone_no":"7035686294",
    "Address":"Manassas,VA 20111",
    "Contact_person":"No contact Person",
    "Details":"Healing Touch for Animals (HTA) is a holistic approach using energy and intention to influence the health and well-being of animals. Energetic techniques are taught to individuals interested in assisting our animals through their life's journey. Courses are offered in cities throughout the US, in Canada and in the Netherlands. \n\nCourse participants work hands-on with dogs and horses where each participant learns the basics of how we can assist animals with their health and well-being, their behavioral issues and their physical, mental or emotional healing process."
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=11540",
    "Name":"Equine Massage Unlimited",
    "Email":"Presuslady(at)aol.com",
    "Website":"http:\/\/www.equinemassageunlimited.netPhone:  703-881-1375",
    "Phone_no":"703-881-1375",
    "Address":"Manassas,VA 20110",
    "Contact_person":"No contact Person",
    "Details":"Serving the Northern Virginia area, also offering a SPECIAL 15% OFF INTRODUCTORY RATE!"
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=14115",
    "Name":"Animal Communicator\/Energy Healing by Marcia Rosenberger",
    "Email":"marcia(at)marciatalks.com",
    "Website":"Phone:  540-364-4609",
    "Phone_no":"540-364-4609",
    "Address":"[MAP]11215 Red Oak LaneMarkham,",
    "Contact_person":"Marcia Rosenberger",
    "Details":"Get direct feedback from your horse to help \n\t-guide veterinary and holistic care \n\t-direct your training efforts \n\t-build a better relationship with your horse\n\nDespite our best efforts, sometimes the health and behavior of our horses leaves us confused and frustrated.  It seems like every step in equine training and care involves a million decisions that leave us wondering, did it work?  Animal communication can shorten this process by giving us feedback directly from the horse.  Better yet, communicating with your horse is the fastest way to improve your relationship.\n\nCall Marcia when you want to ask you horse:\n\tWhere does he hurt?\n\tWhat's stopping her from getting well?\n\tWhy is she behaving badly?\n\tWhy isn't he responding to training?\n\tIs he ready to leave life? \n\nTeam Player\nMarcia is a team player. Animal communication never replaces good veterinary care, rather it helps you find the pain.  Marcia tells you how the situation feels to your horse.  She will work with you or the vet and describe the specific nature of the problem. \nFor example, when you ask why my horse won't eat, he could have pain in his teeth or stomach, smell something odd in his food, or be depressed. With this knowledge, you and your vet can decide which steps to take. Marcia makes farm calls locally or consults over the phone at any distance.\n\nEmotional Healing\nTransitions in home, ownership, and jobs; rescue, sickness, and pain, can all affect a horse's emotions and make it difficult for them to move forward with life and healing.  Using communication and energy work, Marcia can help the horse release emotional blocks to connecting and working with their owners. \n\nEnd of Life Care\nOur most difficult decision can be how to help out animals at the end of life.  Marcia can help you decide if the animal is ready to go, celebrate his life, and ease his passage with communication and energy when the time comes.  You and your horse can grow closer in the process and ease the pain of loss by knowing that you helped them to go with love and compassion.\n\nAbout Marcia\nMarcia is a Certified Reiki Master and professional animal communicator. Marcia works with veterinarians, owners and their horses to improve health, behaviors, and relationships. Marcia is also trained in holistic natural horseman techniques to help develop a positive working relationship between horse and owner.  Communicating with animals since childhood, Marcia took time out to pursue degrees and work in Veterinary Technology, Molecular Biology, Technical and Science Communication, and a teaching certificate before returning to her first love, animal communication. \n\nMarcia follows a strict code of ethics, believing that all communications between you and your animal should remain private unless you desire otherwise.\n\nEmail Marcia@marciatalks.com or text\/call 540-270-7741 for an appointment.\n\nPhoto: Marcia using communication and energy work to assist equine osteopath Dr. Ann-Marie Hancock as she makes physical adjustments."
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=13977",
    "Name":"Dream Catcher Equine LLC",
    "Email":"Dreamcatcherequinellc(at)gmail.com",
    "Website":"http:\/\/Www.dreamcatcherequineva.comPhone:  540-272-8331",
    "Phone_no":"540-272-8331",
    "Address":"Marshall,VA 20115",
    "Contact_person":"No contact Person",
    "Details":"Dream Catcher Equine LLC provides knowledgeable instructors who will guide you on your journey of achieving your equestrian goals in a SAFE, FUN atmosphere. We understand that one's confidence is an essential yet fragile piece of the journey. Our goal is to help you feel safe and secure while allowing you to progress and to encourage you to dream bigger by exposing you to various disciplines and equine activities. Riding should be ENJOYABLE! \n\nOne on one lessons are available along with semi private and group lessons and activities. \n\nWe realize that for some people it is hard to find the riding style that fits you best, which is why we are here to be flexible and help you find your way."
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=13735",
    "Name":"Blue Mountain Equine, LLC",
    "Email":"bluemountainequinellc(at)gmail.com",
    "Website":"http:\/\/www.facebook.com\/bluemountainequinellcPhone:  540-621-5186",
    "Phone_no":"540-621-5186",
    "Address":"Marshall,VA 20115",
    "Contact_person":"No contact Person",
    "Details":"Certified Magna Wave PEMF Practitioner \n\nProviding PEMF Therapy to humans, horses, and small animals in the Northern Virginia and surrounding areas. \n\nPEMF Therapy: \n* Reduces inflammation and pain\n* Increases range of motion \n* Improves blood oxygen levels \n* Increases performance\nAll without the use of drugs! \n\nTo learn more like us on Facebook!\n\nContact us to schedule an appointment."
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=11993",
    "Name":"Virginia Equine Research",
    "Email":"horsesensenutrition(at)yahoo.com",
    "Website":"http:\/\/www.VaEquineResearch.comPhone:  540-253-9987",
    "Phone_no":"540-253-9987",
    "Address":"[MAP]4292 Belvoir RoadMarshall,",
    "Contact_person":"Andrea Donaghy",
    "Details":"Virginia Equine Research develops practical technologies, products and systems, to take your horse to a whole new level of health and soundness through nutrition.  We produce the best feeds in the world at a reasonable price: they are fully decontaminated, highly digestible, roasted feeds.  We never use fillers or by-products. We do use human-grade ingredients for the highest bio-availability.  We are proud to be a Virginia company."
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=12757",
    "Name":"Jan Snodgrass TTouch Training and more!",
    "Email":"excellenthorse(at)earthlink.net",
    "Website":"http:\/\/www.theexcellenthorse.comPhone:  540\/364-7673",
    "Phone_no":"540\/364-7673",
    "Address":"Marshall,VA 20115",
    "Contact_person":"No contact Person",
    "Details":"Does your horses performance suffer because of lack balance? Does he move stiffly or have difficulty bending under saddle? Are you looking to increase your horses range of motion? Has your horse lost coordination after having EPM, Lyme disease or other neurological upset? \n\nFor over 25 years Jan Snodgrass has improved horses lives through TTEAM and TTouch, the wonderful training methods created by Linda Tellington-Jones. TTouch has a proven record of increasing body awareness and balance, relieving soreness and stiffness and is especially helpful for horses recovering from neurological upsets and injuries. This unique method of body work and training exercises will develop, restore and enhance the horses freedom of movement and athletic ability.\n\nJan uses simple, effective exercises to improve flexibility in your horses neck, back and pelvis and strengthen and build your horses top line. She also uses ground exercises to increase eye\/hoof coordination and innovative riding exercises to improve balance under saddle so your horse can move more athletically with increased lightness and responsiveness. \n\nJans more than 35 year equestrian background includes advanced level eventing, third level dressage, reschooling thoroughbreds, training problem horses, rehabbing and conditioning, even trick and liberty training!\n\nDon't give up--get in TTouch!\n\nJan offers monthly training, private training intensives, open clinics, individual sessions and more.\n\nFind out more here: www.theexcellenthorse.com\nRead Jan's Training Tips on Facebook!\nhttps:\/\/www.facebook.com\/pages\/The-Excellent-Horse\/785119968169508"
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=12581",
    "Name":"Inform Alexander Technique LLC",
    "Email":"InformAT(at)jowidner.com",
    "Website":"http:\/\/www.jowidner.comPhone:  804 370-3906",
    "Phone_no":"804370-3906",
    "Address":"[MAP]6268 Bunker Hill DriveMechanicsville,",
    "Contact_person":"Jo Ann Widner",
    "Details":"Alexander Technique and Tai Chi for the equestrian.  Improve your balance, coordination, confidence and riding skills.  Private and semi-private lessons, small groups and workshops.  AmSAT certified instructor."
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=11825",
    "Name":"Middleburg Equine & Canine Reiki",
    "Email":"brookemyatt(at)comcast.net",
    "Website":"Phone:  703-350-2565",
    "Phone_no":"703-350-2565",
    "Address":"Middleburg,VA 20118",
    "Contact_person":"No contact Person",
    "Details":"Brooke \"Cookie\" Myatt is a certified Reiki practitioner in Middleburg who specializes in equine and canine reiki treatments."
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=12500",
    "Name":"Trinity Psychotherapy, LLC",
    "Email":"trinitypsychotherapy(at)gmail.com",
    "Website":"http:\/\/www.trinitypsychotherapy.comPhone:  908-894-2211",
    "Phone_no":"908-894-2211",
    "Address":"[MAP]PO Box 2014Middleburg,",
    "Contact_person":"Donna Maglio",
    "Details":"Trinity Psychotherapy, LLC offers sport and performance consulting for equestrians who may be looking to enhance their competitive edge or for riding-related fears.  Also offered is equine assisted psychotherapy and learning for individuals, groups, couples and families who may be looking for an alternative approach to emotional growth and life-skills learning, as well as organizational team building and leadership development."
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=12179",
    "Name":"Equine Sports Massage Therapy",
    "Email":"equinesportsmassage11(at)yahoo.com",
    "Website":"Phone:  703-853-5899",
    "Phone_no":"703-853-5899",
    "Address":"Middleburg,VA 20117",
    "Contact_person":"No contact Person",
    "Details":"Let a certified ESMT treat your aching horse to a massage that will:\n\n-ease muscle tension \n-release endorphines \n-improve circulation \n-enhance performance\n\n\n\nServicing Middleburg\/Upperville\/The Plains"
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=10593",
    "Name":"McQuillan Equestrian at Kilfinnan Stables",
    "Email":"kilfinnanstables(at)gmail.com",
    "Website":"",
    "Phone_no":"",
    "Address":"Middleburg,VA 20118",
    "Contact_person":"No contact Person",
    "Details":"Situated on 300 acres of pastoral land just ten minutes from Great Meadows and rte.66, McQuillan Equestrian has everything you and your equine partner need to thrive, no matter your goals. Owned and operated by 5-star event rider and professional foxhunter Sean McQuillan and Equine Physiotherapist Kendra McQuillan, McQuillan Equestrian prides itself on a positive, holistic approach, treating each horse as the unique individuals they are.\n\nBoasting a large outdoor arena with watering system and lighting, cross-country course, countless trails, and large windowed stalls with ample turnout, we provide horses the space to thrive both physically and mentally in a low key, positive environment. \n\n With over 30 years of experience, 23 of those as one of Jacqueline Mars's lead trainers and riders, Sean has helped countless equine partnerships reach their goals through his unwavering dedication to the art of horsemanship. With a blend of sports psychology and connective exercises between horse and rider, our positive approach can help you on your journey, whether that's to the highest of levels or to merely enjoy a relaxing trail ride with your equine partner after a long day at work.\n\nMcQuillan Equestrian offers a comprehensive suite of services tailored to meet the diverse needs of sport horse enthusiasts. From personalized training programs and enlightening lessons, we are your partner in realizing your equestrian aspirations."
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=12060",
    "Name":"QuadH",
    "Email":"QuadH4U(at)yahoo.com",
    "Website":"Phone:  540-662-1603",
    "Phone_no":"540-662-1603",
    "Address":"[MAP]621 Kline Mill Rd.Middletown,",
    "Contact_person":"Kathleen Bashian",
    "Details":"Nothing is ever Black and White! Let me help you make the right desicion when having trouble finding out what is wrong with your best friend? Vets having no clue on what is wrong? Having problems with your horses training? or just want to know what your horse is thinking? \n   I can help! I have a gift of being able to see and hear your horse like no one else can. Let me help you and your horse connect and heal togeather! Ask for Kathleen at her work\/home number or email her at you convinance!"
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=13436",
    "Name":"Middle Ridge Farm",
    "Email":"wathompson1(at)gmail.com",
    "Website":"http:\/\/www.middleridgefarm.comPhone:  301-305-6440",
    "Phone_no":"301-305-6440",
    "Address":"[MAP]4102 Valley View RoadMiddletown,",
    "Contact_person":"Whitney Thompson",
    "Details":""
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=13875",
    "Name":"Equine Healings",
    "Email":"Equinehealings(at)gmail.com",
    "Website":"Phone:  571-577-5055",
    "Phone_no":"571-577-5055",
    "Address":"Middletown ,VA 22645",
    "Contact_person":"No contact Person",
    "Details":"Certified Dynamic Healer & Intuitive Practitioner \n\nThrough using alternative therapies such as Emotional Freedom Technique EFT (tapping on acupressure points), Reiki, and supplementary treatments, Andrea has successfully facilited permanent behavioral changes and holistic wellness in the equine.\n\nDoes your horse ~\n-spook easily, \n-suffer in ground manors, \n-stand poorly for the farrier,\n-have behavior issues, \n-traumas, \n-injuries, \n-gut issues, \n-digestive problems,\n-sore muscles, \n-stiff joints\n-allergies \n-birthing process\n-pains....\n\nAndrea will come to you and shift the issue at-hand quickly and efficiently.\n\nThere are articles written in the Equine Wellness Magazine sharing how EFT and Reiki is extremely beneficial in assisting the horse and owner with many issues that arise. EFT is phenomenal for the most challenging rescue equine and preparing them for their new loving home.  \n\nFor more information, please do not hesitate to call 571-577-5055 or email equinehealings@gmail.com.\n\nReferences available upon request"
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=12558",
    "Name":"Tuliza Equine Massage",
    "Email":"tulizamassage(at)gmail.com",
    "Website":"http:\/\/facebook.com\/tulizamassagePhone:  804.307.9260",
    "Phone_no":"804.307.9260",
    "Address":"Midlothian,VA 23112",
    "Contact_person":"No contact Person",
    "Details":"Looking for that competitive edge for you & your best friend? \n\nA massage gives you that something extra and is perfect for anyone - from the trail pony to the top level competitors. Certified by Equissage & Mary Schreiber of Round Hill, VA, I use a unique combination of massage therapy and Reiki energy work to help your horse feel better than ever by loosening up muscles, eliminating scar tissue, and balancing your horse's energy.\n\nBased in Midlothian, VA, I service all of Central VA. Rates are scaled to distance as follows (all prices are full body massage & include Reiki):\n\n$75\/hr in all of Central VA (Richmond, Hanover, Henrico, Chesterfield, Eastern Louisa, Amelia, Southeast Caroline, and a few others)\n$85\/hr for horses over an hour away from my home base in Midlothian\nBeyond an hour and a half, rates will be based on exact location of your horse & how many horses I am coming for. If possible, please schedule more than 2 horses.\n\nMultiple horse discounts:\nBased off of my local area and $75\/hr, 2 horses would be $65\/ea, and 3-5 horses would be $60\/ea. At this point, I do not do more than 5 horses a day.\n\nPlease eMail for any other questions and scheduling, or visit us on Facebook!"
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=12346",
    "Name":"Central Virginia Animal Chiropractic",
    "Email":"animalchiro(at)yahoo.com",
    "Website":"http:\/\/https:\/\/www.facebook.com\/VaAnimalCracker\/Phone:  8049214103",
    "Phone_no":"8049214103",
    "Address":"Midlothian,VA 23112",
    "Contact_person":"No contact Person",
    "Details":"Virginia Equine & Canine Chiropractic is proud to serve the central Virginia region. It's Dr. Tyson's goal to work with you and your veterinarian to provide the best possible chiropractic, cold laser and myofascial care to his clients' animals so that they may continue to provide them with love, companionship, pleasure, work and sport."
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=11779",
    "Name":"Ocean Waves Massage VA",
    "Email":"carrie(at)oceanwavesva.com",
    "Website":"http:\/\/www.oceanwavesva.comPhone:  757-353-0619",
    "Phone_no":"757-353-0619",
    "Address":"Midlothian,VA 23113",
    "Contact_person":"No contact Person",
    "Details":"Equine Massage is fast being recognized as an important tool in the health of your horse.  If the problem is muscular, we can help!  Issues such as muscle tightness, tying up, sore back, or just generally being \"off\" can all be helped with massage.  Contact us today to get your horse on the path to wellness.  Check out www.oceanwavesva.com for prices and more information.  Mention this ad and receive $10 off your first Equine Massage.\n\nYour horse will thank you!"
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=14365",
    "Name":"Advanced Equine LLC",
    "Email":"advancedequinepemf(at)gmail.com",
    "Website":"http:\/\/www.advancedequinellc.comPhone:  8047545453",
    "Phone_no":"8047545453",
    "Address":"Milford,VA 22514",
    "Contact_person":"No contact Person",
    "Details":"Advanced Equine LLC offers PEMF therapy for both horse and rider as well as other animals using state-of-the-art technology from Pulse. Serving central VA and surrounding areas. Visit our website, call, or e-mail for more information. You can also follow us on Facebook!"
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=14411",
    "Name":"Oak Shade Sporthorses, LLC",
    "Email":"oakshadesporthorses(at)gmail.com",
    "Website":"http:\/\/www.oakshadesporthorses.comPhone:  (804) 695-4788",
    "Phone_no":"(804)695-4788",
    "Address":"[MAP]12433 Jefferson Hwy Mineral,",
    "Contact_person":"April Trimmer",
    "Details":"Oak Shade Sporthorses LLC is based out of Headwaters Farm in Mineral, VA with a focus on Dressage and Eventing. Owner April Trimmer is a USDF Silver Medalist with over 20 years experience in the equine industry. Offering lessons, training, young horse development program, and horses for sale\/lease. Standing Morgan stallion Marle Hill Major's Apollo. Certified in Equine Sports Massage and offering PEMF services to the state of VA."
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=14646",
    "Name":"Hidden Hills Equine Massage",
    "Email":"",
    "Website":"No website link",
    "Phone_no":"No Pone number",
    "Address":"Moseley,VA,VA,VA Moseley",
    "Contact_person":"No contact Person",
    "Details":"No Details"
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=14197",
    "Name":"Blue Cedar Farm LLC",
    "Email":"bluecedarfarm(at)yahoo.com",
    "Website":"Phone:  540-319-9271",
    "Phone_no":"540-319-9271",
    "Address":"[MAP]240 Blue Cedar Ln Natural Bridge ,VA,",
    "Contact_person":"Susan  Conner",
    "Details":"I'm a certified equine massage therapist and a licensed veterinary technician. I will travel to you to massage your equine partner.  $70 for 1 horse.  I offer a multi horse discount which brings the price down to $65."
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=13041",
    "Name":"~N~ TOUCH Equine and Canine Massage Therapy",
    "Email":"zxfire(at)aol.com or tracey(at)firemansrunfarm.com",
    "Website":"Phone:  757 876 7705",
    "Phone_no":"7578767705",
    "Address":"[MAP]1360 Riverside DrNew Kent\/ Lanexa\/ Williamsburg,",
    "Contact_person":"Tracey  Leftwich",
    "Details":"~N~Touch massage therapy is dedicated to helping our best friends, our horses and our dogs! If you have ever had a massage then you know how great it feels\n\n\nDescription\n\nIn all my years on this earth, I never dreamed I would be where I' am right now. I have a huge love of animals and I have always hated to see them suffer. Whether it was an injury or suffering at the hands of man. \n I have trained horses the better part of 30 yrs. I always knew there was something more to offer our training horses but could never put my finger on it. Then one day I was rubbing down a horse and he felt knotted up in his back and hind quarters. I then started to rub him down with a form of massage. \n He improved and was very happy after training and waited patiently for a rub down after his work. \n So at that point I have used this on just about all the horses that I have handled. \n Did I know what I was really doing...NO. But it made the horses happy and easier to handle. Just this past April 2014 I made my dreams come true and enrolled in the Equissage massage therapy certification course for Equine and \/Canine therapy.\n This is where I met an awesome woman by the name of Mary Schreiber. My mentor and instructor. My life has changed since that first day in Mary's classroom in the basement of her farm house in Roundhill Va. We are friends and I still enjoy out little conversations when time permits! I want to thank her for all the confidence she gave me through my time spent there! I will always keep her dear to my heart! Now as Mary said\" I have a dream to massage every horse in the world just once....so that each might be favored with the release from pain that any good massage is capable of bringing to the body\" So we will massage on!!!! \n\nThe Benefits of massage.\nEquine sports massage therapy is a non-invasive therapy that aids in the total health of your horse. Your horse's body weight is 60% muscle thus tension and tightening in any part of your horse's body reduces the effectiveness of the whole body.\n\n The benefits of an equine sports massage are many. Circulation is improved, thus promoting more rapid healing of injuries. Muscle tone is enhanced and range of motion is increased. Muscle spasms are eased and tension is relieved. Stimulates circulation in the lymphatic system thus hastening the elimination of waste products and other toxins. Connective tissue is lengthened thus preventing the formation of adhesions. Disposition can also improve. \n\n Compression is the stroke that separates sports massage from other types of massage. When muscle is compressed against the bone, the muscle fibers spread apart. This action frees the restrictions and adhesions in the muscle and allows the blood supply to flow easily into the muscle. The increased blood flow carries oxygen and nutrients to the muscle and aids in removing metabolic waste. Compression is used to break up adhesions in the bellies of the muscle. \n\n An equine sports massage is non-discriminatory. All equine breeds and all disciplines will benefit. \nMaintains the entire body in better physical condition\nAids in preventing injuries and loss of mobility\nBoosts athletic performance and endurance\nRestores mobility to injured muscle tissue\nExtends the good health and overall life of the horse's athletic career\n If your horse is also currently having Chiropractic work done, follow up with Sports massage, even if you fix a skeletal issue, you still have to retrain and work the muscles so the horse can benefit fully from the Chiropractic work performed. \n\n Call or Email today for an appointment. (757) 876-7705\n tracey@firemansrunfarm.com use ( Sports Massage Appt) in the Header in case it goes to Spam mail. Thank you for your interest in E&C Massage Therapy."
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=14332",
    "Name":"Cockade Stables, LLC",
    "Email":"nancybosher(at)gmail.com",
    "Website":"Phone:  8048622588",
    "Phone_no":"8048622588",
    "Address":"[MAP]9208 Fort Dushane Road  Petersburg,",
    "Contact_person":"Nancy Bosher",
    "Details":"Cockade Stables offers a quality horse boarding experience with services and facilities that will meet all your needs.  We offer a fully covered indoor riding arena, full and partial boarding options, quality pastures and personal feeding and care for your equine twice a day, every day!\nAnd Boarding is not our only passion.  Through Khamrada's Hope we serve families through our experiential education programs, bringing them hope, healing, and balance! Our services are not limited and can all be viewed when you visit our amazing website at Cockadestables.com or call us to schedule a visit and see what we can offer you personally!"
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=12773",
    "Name":"Mesa Vista Therapeutics",
    "Email":"mvtlessons(at)gmail.com",
    "Website":"Phone:   804 598 1543",
    "Phone_no":"8045981543",
    "Address":"[MAP]2650 Judes Ferry RdPowhatan,",
    "Contact_person":"Mesa Vista  Therapeutics",
    "Details":"Mesa Vista Therapeutics welcomes traditional and therapeutic riders!\n\nBoarding:\n$775 Full Stall and Training Board\n$525 Full Stall Board\n$200 Co-op board\n\nFacilities:\n-20 stall barn with indoor arena and viewing area\n-Grooming\/tack-up stalls, wash stall, farrier stall\n-2 tack rooms and storage loft\n-Lounge and classroom\n-Acupuncture and massage room under construction\n-Outdoor arena with jumps and round pen\n-Several turnout pastures\n-Nearby trails\n\n\nTraditional Lessons:\n-Hunter\/Jumper, Hunt Seat, Dressage, and Western Pleasure\n-Beginner through Advanced\n\nTherapeutic Lessons:\n-Core and other muscle group strengthening exercises\n-Stretching exercises\n-Balance exercises\n-Attention and focus work\n-Confidence and communication work\n\nHalf hour lessons: $30\nBirthday Parties and Teambuilding Events: $200-250\nPrivate lessons available by request only.\n\n\nFor more information, contact us at mvtlessons@gmail.com"
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=11921",
    "Name":"Little Field Equestrian Services",
    "Email":"LFEquestrianServices(at)me.com",
    "Website":"Phone:  804-432-3555",
    "Phone_no":"804-432-3555",
    "Address":"[MAP]1884 Fairpine DrPowhatan ,",
    "Contact_person":"Kirsten  Contaxis",
    "Details":"Little Field Equestrian Services will begin offering Magna Wave Therapy November 1st.\n\nMagna Wave Therapy is the therapeutic use of High Voltage Pulsed Electro-Magnetic Field (PEMF) Therapy application techniques. It is used for the purpose of improving circulation, increasing blood oxygen, stimulating the lymphatic system, relaxing muscle spasms, relieving tension, enhancing muscle tone, and increasing range of motion in high performance horses.\n\nThat is straight from Magna Wave, which is a brad of PEMF equipment. I think of PEMF as a way to provide a deep tissue massage with the benefits of magnetic therapy. Below are just some of the benefits of PEMF Therapy;\n\nImproves blood flow\nStimulates the lymphatic system\nStimulates the acupuncture points\nImproves blood oxygen levels by increasing cell permeability\nIncreasing range of motion\nRelaxing muscle spasms\nEnhancing muscle tone\nRelieving tension\nReduces pain and inflammation\n\nCall or email for more information and special offers."
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=13876",
    "Name":"Little Field Equestrian Services",
    "Email":"lfeqs(at)me.com",
    "Website":"Phone:  8044323555",
    "Phone_no":"8044323555",
    "Address":"[MAP]3963 Lost Mill RdPowhatan,VA,",
    "Contact_person":"Kirsten Dingus",
    "Details":"Are you looking for an alternative therapy to help your horse perform better or to be more comfortable?  \n\nLittle Field Equestrian Services has been providing Magnawave Therapy since 2010. Magnawave is Pulsed Electro Magnetic Field Therapist (PEMF) \n\nhttp:\/\/www.magnawavepemf.com\nhttps:\/\/www.youtube.com\/user\/TheMagnawave1\n\nLittle Field Equestrian Services is able to provide Ultra Oz demos as well. \n\nhttp:\/\/www.ultroz.com"
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=14274",
    "Name":"Lizaine Equine Massage Therapy",
    "Email":"lizainemassage(at)gmail.com",
    "Website":"http:\/\/www.lizainemassage.comPhone:  7032584448",
    "Phone_no":"7032584448",
    "Address":"Purcellville,VA 20132",
    "Contact_person":"No contact Person",
    "Details":"Equine Sports Massage is a beneficial alternative therapy used to help maintain the entire body of the horse. It is a gentle, meticulous, and natural process crafted to reach every major muscle group in order to ensure maximum comfort.  The sequence encourages the restoration of injured muscles, but can also serve as a preventative therapy with the correct amount of maintenance.\n\n\nWhat are the benefits of Sports Massage?\n-Improves circulation and as a result, promotes rapid healing of injuries.\n-Enhances muscle tone and increases range of motion\n-Eases muscle spasms\n-Reduces inflammation and swelling in the joints so that pain is relieved.\n-Relieves tension\n-Stimulates circulation in the lymphatic system and hastens the elimination of waste products and other toxins.\n-Lengthens connective tissue and so breaks down\/prevents the formulation of adhesions and reduces the danger of fibrosis.\n-Generally improves the disposition of the animal.\n\n\nCERTIFIED by Equissage International\nINSURED by Hands On Trade Association\n\nLOCATED IN LOUDOUN COUNTY, VIRGINIA\n\n*Pricing Varies*"
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=11963",
    "Name":"Mountain View Animal Massage Therapy",
    "Email":"kpaul0(at)earthlink.net",
    "Website":"Phone:  540-554-8752",
    "Phone_no":"540-554-8752",
    "Address":"[MAP]18789 Airmont RoadPurcellville,",
    "Contact_person":"Karen Paul",
    "Details":"I bring my 30+ years of knowledge with both horses and canines to you.  I currently ride in the jumper division, at the Children's\/Adult Jumper level on both the local and rated levels.  Because of my life-long love of horses and dogs, I wanted to offer to them my expertise in equine and canine sports massage, which I obtained through Equissage in Round Hill, Virginia.\n\nIf you would like to schedule a free evaluation or an appointment, please call my home phone (540) 554-8752 or my cell phone (540) 454-1050.\n\nCertified by Equissage, Inc., in Equine Sports\/Canine Massage Therapy.\n\nMember of IAAMT."
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=11877",
    "Name":"Project Horse Empowerment Center",
    "Email":"darcywoessner(at)projecthorse.org",
    "Website":"http:\/\/www.projecthorse.orgPhone:  703-517-6964",
    "Phone_no":"703-517-6964",
    "Address":"Purcellville,VA 20132",
    "Contact_person":"No contact Person",
    "Details":"Project Horse is a nonprofit organization that specializes in delivering mental health services to individuals of all ages. Our non-riding, equine-assisted therapy & wellness programs are fun, engaging and effective! Check out our website to learn more... about our psychotherapy services, our variety of group wellness workshops, and our Veterans-serving program that is delivered at no charge, called Warrior Herd.\n\nTo help support our unique work in the community, Project Horse accepts tax-deductible donations and offers horse sponsorships."
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=11679",
    "Name":"Tally Oaks Veterinary Service",
    "Email":"drtaniawoerner(at)tallyoaksvet.com",
    "Website":"http:\/\/www.tallyoaksvet.comPhone:  540 270 9250",
    "Phone_no":"5402709250",
    "Address":"[MAP]19302 Silcott Springs RoadPurcellville,",
    "Contact_person":"Tania Woerner",
    "Details":"Tally Oaks Veterinary Service provides comprehensive and compassionate at home veterinary care for your dogs, cats, and horses.  Our goal is to combine our holistic approach to health care with the latest and greatest veterinary technology.  Our digital radiography equipment is the best available in an ambulatory practice.  We also pride ourselves on our other diagnostic equipment such as our digital ultrasound, endoscopy, and our dentistry equipment including the powerfloat.  Veterinary services include: wellness exams for all species, prepurhcase examinations, lameness diagnosis, acupuncture and osteopathy, equine reproductive services and of course emergency calls!  Tally Oaks Veterinary Service has emergency coverage 24 hours a day seven days a week!  Appointments are available on Saturdays in addition to weekdays.  Please call us for your Spring wellness exam and vaccinations!  We offer wellness programs for those who like to have a strict budget in mind. We look forward to hearing from you!"
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=12778",
    "Name":"Dunthorpe Farm Veterinary Services",
    "Email":"dunthorpe(at)roadstarinternet.com",
    "Website":"http:\/\/www.Dunthorpefarm.comPhone:  540-668-6232",
    "Phone_no":"540-668-6232",
    "Address":"[MAP]35709 Suffolk LanePurcellville,",
    "Contact_person":"Kelly Foltman",
    "Details":"Veterinary care specializing in equine and small animal acupuncture and chiropractic, and equine dentistry"
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=13650",
    "Name":"Spirit Open Equestrian Program, Inc.",
    "Email":"spiritoep(at)gmail.com",
    "Website":"http:\/\/www.spiritequestrian.org",
    "Phone_no":"",
    "Address":"RESTON,VA 20191",
    "Contact_person":"No contact Person",
    "Details":"Spirit provides therapy, learning and improvement of life skills healing of the body, mind and spirit - using Equine-Assisted Activities.\nMeet SPIRIT at www.spiritequestrian.org"
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=14210",
    "Name":"Horses In Motion",
    "Email":"stacey(at)horsesinmotion.net",
    "Website":"horsesinmotion.netPhone:  5407296333",
    "Phone_no":"5407296333",
    "Address":"Reva,VA 22735",
    "Contact_person":"No contact Person",
    "Details":"Stacey Brown is a certified equine sports massage therapist and a certified canine massage therapist based in Reva, Virginia.  Stacey's practice brings together a passion for equines and canines.   Trained by the premier equine massage institution Equissage International in Round Hill, Va.  Equissage is an accredited program with the American Veterinary Medical Association. \n Stacey brings a sensitive, patient, and enthusiastic approach to her work.  Her diverse backgrounds of owning a horse farm with her husband and son,  showing horses in Hunters and Jumpers, Dressage, Ranch Riding, Cutting, and Trail, barn management, and clinical work allow for a highly individualized approach.  Stacey coordinates with owners, trainers, veterinarians, farriers, and other equine healthcare professionals to promote optimum comfort and function for your equine and canine. \nStacey is a member of the International Association of Equine Sports Massage Therapists."
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=11820",
    "Name":"Stable Grid System",
    "Email":"info(at)stable-grid.com",
    "Website":"Phone:  804 262 7698",
    "Phone_no":"8042627698",
    "Address":"[MAP]4209 Seminary AvenueRichmond,",
    "Contact_person":"Debbie Reed",
    "Details":"Interlocking grid flooring\/footing system for stall floors, run in sheds, muddy gates, around water tubs and hay feeders, walkways, paths, aisle, etc.  You can grow grass through the grid in outdoor areas."
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=14496",
    "Name":"Total You Health",
    "Email":"linda(at)totalyouhealth.org",
    "Website":"https:\/\/www.totalyouhealth.org\/Phone:  5404048858",
    "Phone_no":"5404048858",
    "Address":"[MAP]4370 Starkey Rd Suite 4ARoanoke,",
    "Contact_person":"Linda Bailey",
    "Details":"Total You Health provides a DRUG_FREEE pain relief alternative for horses!  It's called Photobiomodulation (PBM, or red light) therapy and is non-toxic, with no side effects, and is FDA-approved!\n\nBeing around for over 50 years and highly researched, PBM has had over 4,000 lab studies and 500 clinical trials published using PBM therapy.\n\nUsed by world-renowned physio Anna Johnson (British 3-day event team), the O'Connor event team, and ESMT's and veterinarians around the globe, it provides relief of inflammation, pain, and heals wounds quickly.\n\nHere is a testimonial from one of our clients, who owns Bent Tree Farm, home of World Grand Champion carriage driving Fresians and Hackney ponies, \"Due to all the research on different modalities of treatment with red-light therapy, I had Linda use this on several competition horses we are training on our farm. We have had her work on tendons behind the knees, stifles, hocks, cervical, SI, as well as stomach ulcers. One horse had extreme stiffness in his neck post vaccine and the treatment had immediate results. What we are seeing is a higher energy level and improved balanced movement for these high trotting horses.\"\n\nLastly, here are two video testimonials from medical professionals on the benefits of PBM - https:\/\/youtu.be\/MLmE8QE27Ew and - https:\/\/youtu.be\/hC5CTON4G4Q.\n\nPlease call for a quote and pricing!"
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=12130",
    "Name":"Equine Sports Massage Therapy",
    "Email":"ringlet16823(at)yahoo.com",
    "Website":"Phone:  540 290 3688",
    "Phone_no":"5402903688",
    "Address":"[MAP]704 Embly's Gap RoadRoseland,",
    "Contact_person":"Melanie  Carrier",
    "Details":"Certified Equine Sports Massage Therapist\n\n-Enhances muscle tone\n-Increases range of motion\n-Balances, by treating the body as a whole\n-Promotes healing by increasing flow of nutrients to the muscles, and carrying away excessive fluids and toxins\n-Releases tension, creating a positive effect on the contractual and release process of the muscles\n-Stimulates circulation, releasing endorphins (natural pain-killers). (Improved circulation also increases the excretion of toxins through the skin)\n\n-Pre-Event, Post-Event, or upkeep. I will be happy to help your horse any time!\n\nThere are many benefits of massage, please feel free to call or email me with any questions. $50 a session. Sessions run about an hour. \n\nReferences available\n\nCertified by Equissage Inc."
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=14458",
    "Name":"RideSky Equine LLC",
    "Email":"Ridetheskymassage(at)gmail.com",
    "Website":"http:\/\/www.ridetheskymassage.comPhone:  4342358501",
    "Phone_no":"4342358501",
    "Address":"Round Hill,VA 20141",
    "Contact_person":"No contact Person",
    "Details":"Certified ESMT and CMT through Equissage. Specialize in geriatric and abuse\/neglect cases."
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=14371",
    "Name":"Colleen Beers, LVT & Certified Equine Massage Therapist",
    "Email":"cbeerscemt(at)gmail.com",
    "Website":"Phone:  6074377938",
    "Phone_no":"6074377938",
    "Address":"Scottsville,VA 24590",
    "Contact_person":"No contact Person",
    "Details":""
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=14339",
    "Name":"Feel the Love Equine Therapy",
    "Email":"feeltheloveequine(at)gmail.com",
    "Website":"Phone:  434-566-9866",
    "Phone_no":"434-566-9866",
    "Address":"[MAP]PO Box 467Somerset,",
    "Contact_person":"Suzette Bodnar",
    "Details":"We provide PEMF and Cold Laser therapies. PEMF is a proven method to treat inflammation, sore muscles, tendon\/ligament injury, surgery, hoof abscesses and more. We treat our Equine friends, small animals and Humans too. Magnawave Certified Practitioners. Serving all areas of Virginia. Please contact us to set up a free barn demonstration. Full Horse rates start at $75 and last between 30-40 min. Barn\/Trainer discounts available.\n\n\"Helping you and your horse feel better fast\"\n\nSuzette Bodnar\n434-566-9866 Text is best for quick scheduling."
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=14672",
    "Name":"OSF Equine Bodywork, LLC",
    "Email":"osfequinebodywork(at)gmail.com",
    "Website":"https:\/\/www.facebook.com\/osfequinePhone:  703-606-5683",
    "Phone_no":"703-606-5683",
    "Address":"Spotsylvania,VA,VA 22551",
    "Contact_person":"No contact Person",
    "Details":"A passionate horse enthusiast, owner, and competitor dedicated to helping our equine partners stay in top condition! Certified in equine massage, animal neuro-myofascial release, and equine kinesiology taping! Serving Spotsylvania county and surrounding areas. \nEquine Massage - $65\nANMR - $45\nKinesiology Taping - $30 \n\nMultiple horse discount! Reduced rates for combined services! Massage takes about 45 mins to an hour! ANMR and taping is about 30 mins."
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=14648",
    "Name":"CannonBone Farms",
    "Email":"juliette.cannon(at)gmail.com",
    "Website":"https:\/\/cannonboneracing.webs.com\/Phone:  2023306169",
    "Phone_no":"2023306169",
    "Address":"[MAP]13344 post oak rdSPOTSYLVNIA,",
    "Contact_person":"JULIETTE CANNON",
    "Details":"https:\/\/cannonboneracing.webs.com\/\n\nFor many of us horse is a large animal that we cannot really keep at home. We have the dream of having one, being friends with one and riding one. So many of us just go to a farm a ride one and get all sorts of experiences, good or bad. For many  this dream is impossible to realize. For some it falls flat on expectations. \n\nOur Farm and Team started with a dream of understanding horse's way.  The horses we ride are partners. It is perhaps simple fact of nature, that each of them has bounded to humans in a different way. It is because each human's dream about their horse is different. It is because horses can interpret that dream in their own unique way.  In horse's way of life humans need help. And each of our horses knows that. We have helped many people to strengthen their bodies, souls and minds by developing this unique relationship between them and a horse. That horse each time heals people in horse's way. And there isn't a better way of explaining what we do at CBR Stables."
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=13096",
    "Name":"CH Massage",
    "Email":"kkline(at)chmassage.net",
    "Website":"http:\/\/www.chmassage.netPhone:  7036670375",
    "Phone_no":"7036670375",
    "Address":"Springfield,VA 22153",
    "Contact_person":"No contact Person",
    "Details":"Horse and Rider Massage. Align yourself with your horse!\n\nLicensed Massage Therapist providing in home and in-barn services at competitive prices. A graduate of the Blue Ridge School of Massage and Yoga with 2 decades of Equine experience.\n\nI offer multiple modalities from your luxurious Relaxation and Deep Swedish, to Sports Massage and Injury Rehabilitation, finally to Thai Yoga and Shiatsu. I can work on you, your horse, or both. \n\nThe advantages of Massage for both of you:\n-Increase circulation\n-Increase muscle tone and flexibility\n-Boosts your current fitness and nutrition regimen\n\nWhen the horse and rider receive massage regularly from the same, quality therapist, it allows the therapist to target performance issues in both parts of the team. Holding stress in your neck affects how easily your horse can bend through a corner, just as an old injury in your horse can affect your leg communication.\n\nCall, text, or e-mail for appointments and availability."
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=14623",
    "Name":"Horseplay: Equine Sports Massage",
    "Email":"horseplayesm(at)gmail.com",
    "Website":"http:\/\/horseplayESM.comPhone:  (540) 300-2556",
    "Phone_no":"(540)300-2556",
    "Address":"Stafford,VA 22554",
    "Contact_person":"No contact Person",
    "Details":"Offering equine sports massage and groundwork training in Stafford, VA and the surrounding area. Weekend appointments are available. Please check out the website for more information on scheduling and rates. Call, text, or email to request availability."
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=10825",
    "Name":"Wild Toad Stables",
    "Email":"dental(at)ntelos.net",
    "Website":"http:\/\/www.wildtoadstables.comPhone:  540-280-1081",
    "Phone_no":"540-280-1081",
    "Address":"Staunton,VA 24401",
    "Contact_person":"No contact Person",
    "Details":""
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=13637",
    "Name":"Majestic Meadow Stables and Balanced Venture Horsemanship",
    "Email":"mms.bonnie(at)yahoo.com",
    "Website":"http:\/\/www.majesticmeadowstables.comPhone:  540-219-6532",
    "Phone_no":"540-219-6532",
    "Address":"[MAP]23114 Maddens Tavern RoadStevensburg,",
    "Contact_person":"Bonnie Williams",
    "Details":"Majestic Meadow Stables is a 50Ac. horse farm in the heart of Culpeper County.  We offer 2 arena's, round pen, stall and field board opportunities, trails, play yard and much more.  We are a Natural Horsemanship facility so all horses are treated as individuals, respectfully and with your wishes and desires in mind.  We offer a wide variety of grains and feed options.  Many services are free of charge.  Check out our website then call for an appointment.  Our boarders are long term, happy and so are their horses."
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=13638",
    "Name":"Majestic Meadow Stables and Balanced Venture Horsemanship",
    "Email":"mms.bonnie(at)yahoo.com",
    "Website":"http:\/\/www.balancedventurehorsemanship.comPhone:  540-219-6532",
    "Phone_no":"540-219-6532",
    "Address":"[MAP]23114 Maddens Tavern RoadStevensburg,",
    "Contact_person":"Bonnie Williams",
    "Details":"Balanced Venture Horsemanship is a blending of ground work and in the saddle to build rapport, respect and relationship between you and your Equine partner. \nI offer workshops, clinics and lessons in a wide variety of subjects and can help with almost any issue you may have with your horse.  I am a student of Natural Horsemanship, a Certified Rider Biomechanics Instructor under Colleen Kelly and the International Society of Rider Biomechanics.  I teach multi-disciplines and all of my instruction can be used in any discipline as it is about riding the horse, not the saddle.  Please feel free to contact me through my website or with the contact information listed."
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=12480",
    "Name":"Holeywell Therapeutic Horsemanship, Inc.",
    "Email":"hth.sugarmaplefarm(at)gmail.com",
    "Website":"http:\/\/www.HoleywellTherapeuticHorsemanship.com",
    "Phone_no":"",
    "Address":"Troy,VA 22974",
    "Contact_person":"No contact Person",
    "Details":"Holeywell Therapeutic Horsemanship, Inc. is a PATH Intl. Center Member and our Instructor is a PATH Intl. Certified Registered Therapeutic Riding Instructor. \nWe have seven wonderful Therapy Horses of varying sizes to suit most riders.\nHTH provides Horsemanship and Riding Lessons for Riders that have Special Needs including ADD, ADHD, Aspergers, Autism, Cerebral Palsy, Developmental Delays, Down Syndrome, Learning Disabilities, Sensory Processing Disorders, Stroke, and Traumatic Brain Injuries."
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=14160",
    "Name":"Rosalyn Berne",
    "Email":"RWBerne(at)gmail.com",
    "Website":"http:\/\/www.rosalynberne.comPhone:  4345910298",
    "Phone_no":"4345910298",
    "Address":"[MAP]846 Troy RoadTROY,",
    "Contact_person":"Rosalyn Berne",
    "Details":""
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=10143",
    "Name":"Jesse Beranek, Equine Sports Massage Therapy",
    "Email":"sundance_stable(at)hotmail.com",
    "Website":"Phone:  540.538.0012",
    "Phone_no":"540.538.0012",
    "Address":"[MAP]11499 St. Just RdUnionville,",
    "Contact_person":"Jesse Beranek",
    "Details":"Sports Massage Therapy for the Equine Athlete\n\nBenefits of massage therapy include:\n-Increased range of motion\n-Enhanced muscle tone\n-Aids in preventing injuries and loss of mobility\n-Relieves tension\n-Eases muscle spasms\n\nJesse Beranek, ESMT\nCertified by Equissage\nMember of the IAAMT\n\nContact at: 540.538.0012\nsundance_stable@hotmail.com"
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=14247",
    "Name":"The Well Balanced Equine",
    "Email":"balancedequine(at)aol.com",
    "Website":"http:\/\/www.thewellbalancedequine.comPhone:  703 965-7937",
    "Phone_no":"703965-7937",
    "Address":"vienna,VA 22180-4741",
    "Contact_person":"No contact Person",
    "Details":"Whether your horse is a longtime companion for pleasure riding, a competitive barrel racer or is a champion athlete competing at the Grand Prix level or fits somewhere in between. At one time or another, every horse owner has had concerns for their horse's well-being and performance. \nPerhaps your equine partner has had some recent performance changes when you ask him to go up a steep incline on a course, to take that cutting turn, move laterally with ease, or simply to lift his leg so you can look at his hoof. Maybe at first you don't think much of it, he's just having an \"off\" day. But then he starts nipping or kicking when you touch or are just near a certain part of his body. Often times these behavior changes can be due to pain from connective tissue that has tightened and simply won't allow movement without pain. After a while they will simply stop doing that particular movement in order to avoid pain, and can act out negatively in an effort to protect the problem area.\nYou and your horse have been regularly progressing in training and then one day you notice you have reached a plateau.\nIs his\/her stride shorter than it used to be?\nHow's that extension or collection?\nIs your horse able to pick up both leads with ease when asked?\t\nDoes your horse feel balanced?\nIt is not always obvious when there is a connective tissue problem if there has not been an injury. If you have experienced any of the above, and have tried other healing modalities without success then it's time to give Structural Integration bodywork a try. Contact me today!"
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=14395",
    "Name":"Pemrave PEMF",
    "Email":"Eileen(at)pemrave.com",
    "Website":"https:\/\/pemrave.comPhone:  (757) 759-3914",
    "Phone_no":"(757)759-3914",
    "Address":"[MAP]1801 Whiteface CircleVirginia Beach,",
    "Contact_person":"Eileen Galyon",
    "Details":"Pemrave PEMF is a mobile pulsed electromagnetic field therapy service. We are available in Southeastern Virginia and the surrounding areas.  PEMF therapy is drug free and non invasive.  This therapy reduces inflammation, soreness and pain while supporting your horse's body on a cellular level.  This therapy is good for your horse whether they run, jump, turn and burn or enjoy the trails."
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=14149",
    "Name":"Sarah Mahoney, Equine Sports Massage Therapy",
    "Email":"mahoneyequine(at)yahoo.com",
    "Website":"http:\/\/www.mahoneyequine.com",
    "Phone_no":"",
    "Address":"Virginia Beach,VA 23462",
    "Contact_person":"No contact Person",
    "Details":"Sarah Mahoney is a certified equine sports massage therapist moving to Va. Beach late July. Massage sessions will be available for scheduling beginning August 1.Travel to other areas of Virginia are available with a certain number of horses scheduled at your barn. Sessions are $75 per horse plus a trip fee dependent on barn location.\n\nOptimize your horse's performance and your riding experience. ​A sports massage treatment is great to release tension and stress, increase circulation, relax muscle spasms, enhance muscle tone, and increase range of motion in your horse. A combination of massage strokes and acupressure find and treat trigger points providing a wide-ranging set of benefits for the horse's entire body, ranging from relieving muscular tension, improving performance, promoting relaxation, stimulating digestion, and more."
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=14689",
    "Name":"Unhindered Equine",
    "Email":"UnhinderedEquine(at)gmail.com",
    "Website":"https:\/\/unhinderedequine.com\/Phone:  7576302920",
    "Phone_no":"7576302920",
    "Address":"Virginia Beach,VA 23456",
    "Contact_person":"No contact Person",
    "Details":"Bring yourself peace of mind and your horse comfort with Unhindered Equine bodywork. Based in Va. Beach and servicing the Tidewater area."
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=13184",
    "Name":"Great Neck Massage",
    "Email":"Greatneckmassage(at)gmail.com",
    "Website":"Phone:  757-373-5754",
    "Phone_no":"757-373-5754",
    "Address":"Virginia Beach,VA 23454",
    "Contact_person":"No contact Person",
    "Details":"Specializing in massage for the equestrian for improved posture and a softer more relaxed seat.  Specializing in equine massage for a more relaxed and willing horse.\nAs a rider you owe it to your horse to seek out those modalities that help you ride your best.  If you are suffering from chronic pain or discomfort, it's virtually guaranteed that your horse is feeling it too.  These problems hinder and frustrate, and in many cases prevent the advancement of your skills as a rider.  Reducing stress and tension is also going to benefit both horse and rider. \n\nCompeting, riding for pleasure or just life itself can be stressful.  Obtaining complete relaxation, symmetry and awareness between horse and rider is my objective.  \n\nContact me today for more information and to make your appointment.\n\n$55.00\/ one hour massage"
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=12845",
    "Name":"Beach MicroCurrent, LLC",
    "Email":"beachmicrocurrent(at)gmail.com",
    "Website":"http:\/\/www.BeachMicroCurrent.comPhone:  757-647-4059",
    "Phone_no":"757-647-4059",
    "Address":"[MAP]3924 Dawley RoadVirginia Beach,",
    "Contact_person":"Judi Fisher",
    "Details":"Beach MicroCurrent offers both Thermal Imaging and MicroCurrent Therapy for your horse.  MicroCurrent Therapy is the application of low level electrical current, similar to that which flows naturally in a healthy horse, to the body.  MicroCurrent jump-starts the body's self healing mechanisms which speeds up a horse's rate of recovery.  Painless, quiet, and enjoyable for your horse.  Amazing results."
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=12624",
    "Name":"Sleipnir Saddlery Nonprofit Organization",
    "Email":"amanda(at)sleipnirsaddlery.com",
    "Website":"Phone:  8134862253",
    "Phone_no":"8134862253",
    "Address":"[MAP]1124 Bay Colony DriveVirginia Beach,",
    "Contact_person":"Amanda Anderson",
    "Details":"Sleipnir Saddlery & BodyWorks Nonprofit Organization is the first of its kind! We offer Saddle Fitting & Reflocking, Billet Replacement, Saddle Consultations, Equine Massage, and Rider Fitness & Troubleshooting.\n\nHere's how it works: \nYOU get any of the above services. \nYour DONATION for these services goes to a CHARITY of your choice. \nYOU give back to the community!\n\nOur Saddle Fitter is German-trained on a variety of saddles, and services ALL brands and disciplines. \n\nLong or short BILLETS available.\n\nQUALITY wool for REFLOCKING.\n\nFor more information, or to schedule an appointment, CALL or EMAIL us!\n\nCheck us out on FaceBook!"
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=11153",
    "Name":"Jane Nordstrom Training",
    "Email":"jn1193(at)aol.com",
    "Website":"http:\/\/www.janenordstrom.comPhone:  703-966-0139",
    "Phone_no":"703-966-0139",
    "Address":"[MAP]8699 Green RoadWarrenton ,",
    "Contact_person":"Jane Nordstrom",
    "Details":"Confidence Shows! Specializing in helping riders work through confidence & riding anxieties whether in the show ring, in the field or at home. Let Jane's 30 years of teaching & training experience help you achieve your riding goals.  Learn how to use your body correctly to make your horse go correctly - in   more balanced, relaxed & flexible manner. \n\n\nCall today to make an appointment to meet Jane.  We just relocated to Paradigm Stables in Warrenton. \n  \n\nJane is based out of Fox Chase Farm, Middleburg, VA conviently located on Route 50 close to Route 15; or is available to come to your farm."
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=14509",
    "Name":"Sarah Steed, L. Ac.",
    "Email":"sarahsteedacupuncture(at)gmail.com",
    "Website":"http:\/\/acusteed.comPhone:  5403473667",
    "Phone_no":"5403473667",
    "Address":"[MAP]9 N 3rd St, suite 208Warrenton,",
    "Contact_person":"Sarah Steed",
    "Details":"Acupuncture & Traditional Chinese Medicine for Human patients and all equestrians\nCall for free 15 minute consultations or email from website  acusteed.com"
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=10428",
    "Name":"Pinecroft Sport Horses",
    "Email":"pinecroft99(at)yahoo.com",
    "Website":"Phone:  703-727-1958",
    "Phone_no":"703-727-1958",
    "Address":"[MAP]PO Box 356Washington, VA ,",
    "Contact_person":"Bob Rush",
    "Details":"MASSAGE THERAPY - SADDLE FITTING\n\nGet your partner ready for the coming competition season.\nTight, sore muscles can manifest in performance riddled with stiffness and resistance. Benefit from my experience in helping horses perform with more comfort, suppleness and athleticism. Will travel to your barn - Call 703-727-1958 for further details."
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=11433",
    "Name":"TTouch of Love",
    "Email":"joyce(at)cloudninesaddlepads.com",
    "Website":"Phone:  571-882-0551",
    "Phone_no":"571-882-0551",
    "Address":"[MAP]PO Box 67White Post VA 22663,",
    "Contact_person":"Joyce Anderson",
    "Details":"TTouch of Love describes the way we all wish to connect with our horses.  TTEAM & TTOUCH Practitioner, Joyce Anderson, former apprentice of Linda Tellington, is now available for individual horse sessions, clinics and presentations to horse groups.  Tellington TTouch Equine Awareness Method, TTEAM uses the Tellington TTouches to reorganize the horse's nervous system by replacing tension with relaxation and trust.  The horse learns to be less reactive, developes confidence in new situations which results in better performance.  It's simply, quite literally,  the \"...TTouch That Teaches!...\""
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=11272",
    "Name":"Animal Communicator Charlotte Kaspareck",
    "Email":"ckaspareck(at)hotmail.com",
    "Website":"Phone:  757-566-4777",
    "Phone_no":"757-566-4777",
    "Address":"Williamsburg,VA 23188",
    "Contact_person":"No contact Person",
    "Details":"I offer animal communication services by telephone, all animals, specializing in horse communications."
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=11979",
    "Name":"Hands on Horses, LLC",
    "Email":"angela(at)handsonhorsesllc.com",
    "Website":"Phone:  (757) 604-1400",
    "Phone_no":"(757)604-1400",
    "Address":"[MAP]Po Box 6762Williamsburg,",
    "Contact_person":"Angela Hirose",
    "Details":"Offering pet and horse sitting. Professional with experience and references."
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=12008",
    "Name":"TouchTech Therapies Mobile Massage Therapist (for People)",
    "Email":"HandzOn.VA(at)gmail.com",
    "Website":"http:\/\/www.touchtech.byregion.netPhone:  7038688667",
    "Phone_no":"7038688667",
    "Address":"[MAP]Northern VAWoodbridge,",
    "Contact_person":"Tom Blanchard",
    "Details":"Tom Blanchard, a Master Massage Therapist, certified by the VA Board of Nursing, with more than 25 years of experience, utilizes various techniques for the relief of Stress, Muscle Pain, and Sports or Over-use injuries. Tom's approach, after thorough consultation with the client, is to apply the techniques most applicable to the specific need. Generally, an eclectic-style method is used to integrate more than one technique or modality to give full benefit to the relief and recovery of the client.\n\nThis is a Mobile Service approved by HMO, PPO and other Health Plans for discount billing. (Consult your own Health Benefits Providers Guide) We come to you for a massage in a setting that is comfortable to you. No need to get a relaxing massage and then lose the benefits in gridlock on the way home.\n\nTouchTech Mobile Massage Therapist is an Elite Personal Care Service which uniquely brings luxurious professional pampering into the convenience and privacy of your home, hotel or office. An expert therapist will bring a portable massage table, oils, creams, aromas and meditation\/relaxation music. The personal wellness treatment will transform your home, hotel or office into a sanctuary of plush relaxation. A confidential health status form will be filled out at the start of the session in order to best assess your physiological needs. Our commitment is to restore and enhance your body, mind and spirit."
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=14622",
    "Name":"Two Hands Equine Massage",
    "Email":"twohandsequinemassage(at)gmail.com",
    "Website":"http:\/\/www.twohandsequinemassage.comPhone:  4144779250",
    "Phone_no":"4144779250",
    "Address":"Woodbridge,VA 22193",
    "Contact_person":"No contact Person",
    "Details":"Maintain. Rehabilitate. Invigorate. \nTwo Hands Equine Massage\nServicing NOVA and surrounding areas\nBarn and show calls\n\n$5 off first session\n10% discount for military\/first responders\nPackage discounts\n\nBe proactive instead of reactive when it comes to your horse's performance, attitude and overall well-being. \nWhen they feel their best, mentally and physically,  you can expect great results.  For the athletes, give them the upper hand in the ring to show what they can really do.  For the companions, help them live a comfortable, pain relieved life.  \n\nAll disciplines, workloads, ages benefit. \n\nContact me to schedule your session. I'm happy to answer any questions."
  }
]