[
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=11577",
    "Name":"Rappahannock Animal Welfare League - RAWL",
    "Email":"",
    "Website":"Click Image to View Larger",
    "Phone_no":"ImagetoViewLarger",
    "Address":"Amissville,VA 20106",
    "Contact_person":"No contact Person",
    "Details":"No Details"
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=12426",
    "Name":"Pinecrest Stables",
    "Email":"Pinecrest_stables(at)yahoo.com",
    "Website":"http:\/\/Www.pinecreststables.weebly.comPhone:  276-226-0766",
    "Phone_no":"276-226-0766",
    "Address":"[MAP]869 Muddy Fork RdBassett,",
    "Contact_person":"Leah Metz-Hylton",
    "Details":"Full service equestrian facility located on almost 1300 acres. We host events all yr long in our large lit outdoor arena & round pen. From competitive or pleasure riding we offer lessons & instruction for both you and your horse in a safe & fun atmosphere. 4-H, gymhkhana, trail, competitive trail riding,  hunter under saddle, western pleasure, western performance, saddleseat, walking & racking.  Beginners to advanced. Clinics, day camps, birthday parties, pony rides, guided trail rides, training, transportation, boarding, breeding of high quality appaloosas & performance quarter horses, equine & tack sales. Certified instructor & licensed vet tech on site 24 hrs. Family atmosphere, let us help u with your equestrian needs!"
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=12425",
    "Name":"Leasor Farrier Services",
    "Email":"farrierjon(at)hotmail.com",
    "Website":"Phone:  304-671-1124",
    "Phone_no":"304-671-1124",
    "Address":"[MAP]131 Allegheny Ridge LaneBerryville,",
    "Contact_person":"Jon Leasor",
    "Details":"Balanced trimming and shoeing for the performance horse."
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=12747",
    "Name":"Cadillac Cup Polo",
    "Email":"tracey(at)echelon-events.com",
    "Website":"http:\/\/cadillaccuppolo.com\/Phone:  804-305-0601",
    "Phone_no":"804-305-0601",
    "Address":"[MAP]1082 Forest Lodge LaneCharlottesville,",
    "Contact_person":"Tracey Leverty",
    "Details":"Here is your chance to be a part of an incredible event that provides an environment unlike any other! This action-packed afternoon combines sports, entertainment, business networking and charitable giving to provide a fun and fulfilling day with friends and colleagues, old and new!\n\nThe 2013 Cadillac Cup is privileged to support four charities; all doing incredible work both locally and globally.\n\n- Goochland Free Clinic and Family Services\n\n- Virginia Wounded Warrior Program\n\n- Ronald McDonald House Charities of Richmond\n\n- Virginia Polo Center\n\nBy supporting this event, numerous objectives can be met from a business perspective:\n\n Your brand will be exposed to a desirable demographic through recognition at the event, as well as in all pre-event marketing tie-ins.\n\n Your afternoon will be spent networking in a relaxed and glamorous atmosphere with plenty of time to mingle with your peers while sipping champagne, savoring a gourmet lunch and being entertained by the fast paced action of Polo.\n\n Your business will be poised for inclusion in future matches, which promises to become a highly sought after and sold out affair."
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=10059",
    "Name":"Northern Virginia Therapeutic Riding Program, NVTRP",
    "Email":"info(at)nvtrp.org",
    "Website":"http:\/\/www.nvtrp.orgPhone:  703-764-0269",
    "Phone_no":"703-764-0269",
    "Address":"[MAP]PO Box 184Clifton,",
    "Contact_person":"Breeana Bornhorst, Executive Director",
    "Details":"The Northern Virginia Therapeutic Riding Program provides equine assisted activities and therapeutic riding to children and adults with disabilities, youth-at-risk, veterans and their families in an inclusive, community setting. We work with those who are challenged physically, mentally, and emotionally. By focusing on each rider's ability rather than disability, we have enjoyed a high rate of success in areas such as improved balance, coordination, muscular strength, social skills, and self-confidence. \n\nOur program is accredited and nationally recognized by the North American Riding for the Handicapped Association (NARHA). Lessons are taught by NARHA Certified Riding Instructors assisted by up to threed volunteers per rider. This structure enables our riders to participate in a challenging, physically active sport. Through this unique riding opportunity, our students achieve enriched quality of life."
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=12241",
    "Name":"Bordeaux Farms",
    "Email":"bordeauxfarms07(at)gmail.com",
    "Website":"http:\/\/www.bordeauxfarms.comPhone:  804.761.2614",
    "Phone_no":"804.761.2614",
    "Address":"[MAP]1543 Beahm Town RoadCulpeper,",
    "Contact_person":"Jacob Dudek",
    "Details":"Bordeaux Farms, LLC was established for a training, boarding and breeding facility for the enhancement of equine.  We want horses and people to accel at their passion.  Bordeaux Farms is in beautiful Madison County, between Culpeper and Orange on the Robinson River. \n\nThis family owned facility includes 168 acres of gently rolling hills, wooded trails, lush green pastures, streams, springs and approximatly a mile of river frontage.  The entire farm is fenced and crossed fenced. Our main stable features 18 stalls, while our other barns feature 27  miniature to draft sized stalls.\n\nAmenties include: Climate controlled lounge with cable t.v., 2 bathrooms (one with a shower), laundry, tackrooms, lockers, one hot\/cold wash stall, 3 outdoor wash stalls for cooling down in the summer heat, lighted 100 x 200 riding arena with judges stand, smaller lighted riding ring and trails around the farm.\n\nBordeaux Farms is a full-service boarding and training facility for all disciplines.  Where boarded horses are turned out daily in one of our 25 boarded paddocks.."
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=13558",
    "Name":"Virginia Horse Festival",
    "Email":"kdixon(at)meadoweventpark.com",
    "Website":"http:\/\/www.virginiahorsefestival.comPhone:  8042901137",
    "Phone_no":"8042901137",
    "Address":"[MAP]13111 Dawn Blvd.Doswell,",
    "Contact_person":"Kathy Dixon",
    "Details":"The second annual Virginia Horse Festival presents a comprehensive look at the equestrian industry with three days of clinics, demonstrations, exhibits and shopping. It's April 1-3, 2016, at The Meadow Event Park, birthplace of Secretariat. This year we host the Colt Starting Challenge USA, where contestants compete to gentle and ride a previously unbroken horse. Go to www.virginiahorsefestival.com for more information."
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=11392",
    "Name":"Secret Passage Ranch",
    "Email":"",
    "Website":"No website link",
    "Phone_no":"No Pone number",
    "Address":"Fort Valley,VA 22652",
    "Contact_person":"No contact Person",
    "Details":"No Details"
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=11672",
    "Name":"Battlefield Park Polo Club",
    "Email":"delorab(at)hotmail.com",
    "Website":"http:\/\/www.battlefieldparkpolo.comPhone:  239-989-2011",
    "Phone_no":"239-989-2011",
    "Address":"[MAP]5704 Pageland LaneGainesville,",
    "Contact_person":"Dori  Burner",
    "Details":"Battlefield Park Polo Club is a United States Polo Association recognized club and is multi-use facility which offers a wide range of services to fulfill your equestrian needs, polo, jumping, and dressage are taught here. \n\nBattlefield Park Polo is located just 2 miles off I-66 at exit 43B in Gainesville and we are just across the street from the historic Manassas Battlefield where there are miles of trails.  \n\nWe have recently completed construction on a large outdoor arena 120' x 200', an indoor arena 75' x 150' with 10 attached stalls and a 400 sq. ft.  lounge\/tack\/viewing area.  We have another new 10 stall barn with tack and feed room, and a new guest house.  We have 25 acres of turnout available for our 18 school horses.\n\nBattlefield Park offers a wide range of services: Riding Lessons in all Disciplines, Polo Lessons, Summer Camp, Green\/Problem Horse Training, Farrier, Transportation, Boarding,  Pony Club Activities, Trail Riding, Tack Sales, Horse Sales, Horse Leasing, Event Services such as Pony Parties, Weddings, and Corporate Polo Parties and Trail Rides.\n\nWe offer USPA Interscholastic and Intercollegiate Polo Programs.\n\nWe have clients of all ages who can come to Battlefield Park Polo to learn how to ride and enjoy horses. We have exceptionally low prices and make horses accessible to everyone!  Come out and have some fun!"
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=11659",
    "Name":"Total Equine Veterinary Associates (Drs Jay Joyce and Sallie Hyman)",
    "Email":"info(at)totalequinevets.com",
    "Website":"http:\/\/www.totalequinevets.comPhone:  703 505 2320",
    "Phone_no":"7035052320",
    "Address":"Leesburg,VA 20176",
    "Contact_person":"No contact Person",
    "Details":"Complete equine veterinary and dental services.\n24\/7 Emergency coverage. Specialists.\nDigital rads, lameness eval, pre-purchase exams.\nComprehensive Wellness Programs.\nGreat team. Great practice."
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=10593",
    "Name":"McQuillan Equestrian at Kilfinnan Stables",
    "Email":"kilfinnanstables(at)gmail.com",
    "Website":"",
    "Phone_no":"",
    "Address":"Middleburg,VA 20118",
    "Contact_person":"No contact Person",
    "Details":"Situated on 300 acres of pastoral land just ten minutes from Great Meadows and rte.66, McQuillan Equestrian has everything you and your equine partner need to thrive, no matter your goals. Owned and operated by 5-star event rider and professional foxhunter Sean McQuillan and Equine Physiotherapist Kendra McQuillan, McQuillan Equestrian prides itself on a positive, holistic approach, treating each horse as the unique individuals they are.\n\nBoasting a large outdoor arena with watering system and lighting, cross-country course, countless trails, and large windowed stalls with ample turnout, we provide horses the space to thrive both physically and mentally in a low key, positive environment. \n\n With over 30 years of experience, 23 of those as one of Jacqueline Mars's lead trainers and riders, Sean has helped countless equine partnerships reach their goals through his unwavering dedication to the art of horsemanship. With a blend of sports psychology and connective exercises between horse and rider, our positive approach can help you on your journey, whether that's to the highest of levels or to merely enjoy a relaxing trail ride with your equine partner after a long day at work.\n\nMcQuillan Equestrian offers a comprehensive suite of services tailored to meet the diverse needs of sport horse enthusiasts. From personalized training programs and enlightening lessons, we are your partner in realizing your equestrian aspirations."
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=11998",
    "Name":"Country Classics",
    "Email":"cdrigdencountryclassics(at)gmail.com",
    "Website":"http:\/\/www.englishcountryclassics.comPhone:  5406873686",
    "Phone_no":"5406873686",
    "Address":"[MAP]21 East Washington StreetMiddleburg,",
    "Contact_person":"Country Classics",
    "Details":"Country Classics is having their annual Anniversary Sale! Enjoy 50% OFF select Men's shirts, jackets, blazers, trousers, waistcoats, and coats! 50% off ladies' shirts, trousers, waistcoats, and jackets! Get the hunt country look. Perfect style for hunt breakfasts and the Middleburg races. \n\nThe sale only happens once a year so come in today!"
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=14348",
    "Name":"Old Hundred Stables",
    "Email":"victoria(at)rvarealtor.com",
    "Website":"Phone:  8047745583",
    "Phone_no":"8047745583",
    "Address":"Midlothian,VA 23114",
    "Contact_person":"No contact Person",
    "Details":"Small Hobby Farm catering to a few boarders, Indoor Riding Arena, Wedding Events, Range Free eggs and more."
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=11704",
    "Name":"Sandstone Farm L.L.C.",
    "Email":"sandstonefarm(at)aol.com",
    "Website":"http:\/\/www.sandstonefarm.comPhone:  540-837-1261",
    "Phone_no":"540-837-1261",
    "Address":"[MAP]3805 Millwood RdMillwood,",
    "Contact_person":"Luci Strange \/ Sandstonefarm.com",
    "Details":"Sandstone farm is a full service training and show facility on 36 acres of beautiful rolling country side near the Shenandoah River. Conveniently located 1\/2 mile off Rt 50 in Eastern Clarke Co. in the Blue Ridge Hunt Country.  We offer instruction in Hunter, Jumpers, fox hunting and Dressage.  A fine selection of Welsh cross ponies and selected horses, are for sale... Call for an appointment 540-837-1261"
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=10083",
    "Name":"Sandstone Farm L.L.C.",
    "Email":"sandstonefarm(at)aol.com",
    "Website":"http:\/\/annual eventsPhone:  540-837-1261",
    "Phone_no":"eventsPhone540-837-1261",
    "Address":"[MAP]3805 Millwood Rd P.O.Box 365Millwood,",
    "Contact_person":"Luci Strange",
    "Details":"Hunter Horse shows: \nPony hunters  \nJUMPER SHOWS $$$$\nCOMBINED TEST check sandstonefarm.com\ncall 540-837-1261"
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=12137",
    "Name":"Spring Valley Farm",
    "Email":"info(at)spgvalleyfarm.com",
    "Website":"http:\/\/www.spgvalleyfarm.comPhone:  540-309-6884",
    "Phone_no":"540-309-6884",
    "Address":"[MAP]1190 Horseshoe Bend RdMoneta,",
    "Contact_person":"Chad Simmons",
    "Details":"Spring Valley Farm offers multiple horseman needs. We train to ride and drive, boarding, breeding, bed and breakfast, cabin rentals, sell\/trade of horses and mini horses and donkeys. We have all disciplines of horses on our farm. Spring Valley also sells project horses. Please feel free to contact us or visit our website. It is undercontruction but still has info on it spgvalleyfarm.com"
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=12642",
    "Name":"Horsin' Around Camp!",
    "Email":"crosskeysequinetherapy(at)gmail.com",
    "Website":"http:\/\/www.crosskeysequinetherapy.orgPhone:  540-607-6910",
    "Phone_no":"540-607-6910",
    "Address":"[MAP]6711 Stoney Lick RdMt Crawford,",
    "Contact_person":"Alicia Burns",
    "Details":"Horsin' Around is a summer program for kids to come learn about all aspects of horse and pony care. They have hands-on activities with the horses, and learn about nutrition, horse care, grooming, and exercise through games and crafts. Once the relationship with the horses is established, they get to learn basic riding skills. Camps run from 8:30am-11:30am. The camp dates for 2013 are June 10-13, June 24-27, July 8-11, and July 29-Aug 1.\n\n$175\/week if registered before May 1st!\n$200\/week after May 1st\n\nSpaces fill quickly so register early!\n\nHorsin' Around Pony Camp is a program by Cross Keys Equine Therapy, a non-profit that offers equine assisted therapy services to children, adults, and families. A portion of the camp fee goes to support the horses and clients in the therapy program.\n\n(540) 607-6910\n\ncrosskeysequinetherapy@gmail.com\n\nwww.crosskeysequinetherapy.org"
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=9775",
    "Name":"Hollow Oak Farm, Inc.",
    "Email":"lynniefnp(at)msn.com",
    "Website":"http:\/\/www.hollowoakfarm.comPhone:  703-594-3263",
    "Phone_no":"703-594-3263",
    "Address":"[MAP]12240 Aden RoadNokesville,",
    "Contact_person":"Lynn Sadler",
    "Details":"New Riding Facility in Nokesville, VA. We offer boarding, lessons, training, and horse shows. Immediate availability. Indoor arena coming soon. Call for pricing. Adjacent to Nokesville Park & Equestrian Ring. Lots of trails."
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=14332",
    "Name":"Cockade Stables, LLC",
    "Email":"nancybosher(at)gmail.com",
    "Website":"Phone:  8048622588",
    "Phone_no":"8048622588",
    "Address":"[MAP]9208 Fort Dushane Road  Petersburg,",
    "Contact_person":"Nancy Bosher",
    "Details":"Cockade Stables offers a quality horse boarding experience with services and facilities that will meet all your needs.  We offer a fully covered indoor riding arena, full and partial boarding options, quality pastures and personal feeding and care for your equine twice a day, every day!\nAnd Boarding is not our only passion.  Through Khamrada's Hope we serve families through our experiential education programs, bringing them hope, healing, and balance! Our services are not limited and can all be viewed when you visit our amazing website at Cockadestables.com or call us to schedule a visit and see what we can offer you personally!"
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=12462",
    "Name":"The Mary Schwentker Cross Country Clinic",
    "Email":"spiatt(at)cfcfarmhome.com",
    "Website":"http:\/\/cfcfarmhome.net\/webdocs\/DocView.aspx?wdID=259&locID=0Phone:  540-439-3254",
    "Phone_no":"540-439-3254",
    "Address":"[MAP]27510 Mine Run Rd.Rhoadesville,",
    "Contact_person":"Sharon Piatt",
    "Details":"On September 22, CFC Farm & Home Center and Pace-Maker Horse Feeds will again sponsor the Mary Schwentker Cross Country Clinic at Win Green Farm in Rhoadesville, Virginia. Ms. Schwentker is an accomplished international 3-day event competitor and trainer. Win Green Farm, located at 27510 Mine Run Rd. in Rhoadesville (http:\/\/www.wingreenxc.com\/) offers Eventing features such as water jumps with multiple approaches, banks and ditches, sunken road, Weldon's Wall, skinnies, and more. Also included is a Trakenher designed to challenge the rider, but not trouble the horse, plus confidence building and straight-forward log jumps. \n\nRegistration is $85, and includes rider, horse, and one auditor. Individual auditor registration is $10. Lunch is included in registration fees. \n\nRegistration forms can be picked up at any CFC Farm and Home Center, or online at www.cfcfarmhome.com. Pre-registration is required. The registration deadline is September 14, 2012. Call Sharon Piatt for more information at 540-439-3254 or email at spiatt@cfcfarmhome.com."
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=12527",
    "Name":"Horses In Service",
    "Email":"horses.in.service(at)gmail.com",
    "Website":"http:\/\/www.horsesinservice.org",
    "Phone_no":"",
    "Address":"[MAP]6301 Hines RoadRichmond,",
    "Contact_person":"Niki LeHew",
    "Details":"Horses In Service, a non-profit organization, which provides therapeutic riding lessons for people with disabilities.  H.I.S mission is to encourage people with disabilities, their families and friends to achieve an enriched quality of life through physical, emotional, social, spiritual and educational development using the dynamics of therapeutic horseback riding.  To educate staff, horsemen and the community in natural horsemanship and therapeutic riding, through publications, newsletters and training sessions.  We have annual fundraisers such as spaghetti dinners, trail rides.   H.I.S has volunteer opportunities such as side walkers, horse leaders, barn help and instructors."
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=13637",
    "Name":"Majestic Meadow Stables and Balanced Venture Horsemanship",
    "Email":"mms.bonnie(at)yahoo.com",
    "Website":"http:\/\/www.majesticmeadowstables.comPhone:  540-219-6532",
    "Phone_no":"540-219-6532",
    "Address":"[MAP]23114 Maddens Tavern RoadStevensburg,",
    "Contact_person":"Bonnie Williams",
    "Details":"Majestic Meadow Stables is a 50Ac. horse farm in the heart of Culpeper County.  We offer 2 arena's, round pen, stall and field board opportunities, trails, play yard and much more.  We are a Natural Horsemanship facility so all horses are treated as individuals, respectfully and with your wishes and desires in mind.  We offer a wide variety of grains and feed options.  Many services are free of charge.  Check out our website then call for an appointment.  Our boarders are long term, happy and so are their horses."
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=11427",
    "Name":"Summerplace Farm",
    "Email":"info(at)summerplacefarm.com",
    "Website":"http:\/\/www.Summerplacefarm.com",
    "Phone_no":"",
    "Address":"The Plains,VA 20198",
    "Contact_person":"No contact Person",
    "Details":"2011 Horse shows start April 2, 2011.  Come spend the say at Summerplace"
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=10617",
    "Name":"PicturesqueFarm",
    "Email":"kristy(at)picturesquefarm.com",
    "Website":"http:\/\/www.picturesquefarm.comPhone:  540-349-2026",
    "Phone_no":"540-349-2026",
    "Address":"[MAP]7769 Piccadilly DriveWarrenton,",
    "Contact_person":"Kristy Willwerth",
    "Details":"Picturesque Farm is situated on 36 acres located on the south side of Warrenton, Va.  The 28 stall show barn has a heated\/air conditioned lounge and bathroom, two double wash stalls with hot and cold water, and two large tack rooms.  There is a huge 200' x 160' all weather sand outdoor arena with a new course of jumps, a 140' x 75' indoor arena. The horses & ponies are all privately owned show horses.  The riding stable specializes in hunters with strong basics in groundwork & equitation as well as cross country schooling, trail riding and foxhunting. In addition to teaching lessons, we show extensively in rated and local VHSA shows, train\/reschool, buy, sell and have a consignment program as well.  We are members of the VHSA and have 9 hunter schooling shows each summer.  There is an annex to Picturesque Farm that is an additional 200 acres which houses our stallion, the nursery and over 110 acres of private trails. Please call the office at 540-349-2026 or feel free to email us at: kristy@picturesquefarm.com"
  },
  {
    "url":"http:\/\/www.virginiaequestrian.com\/main.cfm?action=greenpages&sub=view&ID=11766",
    "Name":"Hermitage Hill Farm & Stables",
    "Email":"info(at)hermitagehillfarm.com",
    "Website":"http:\/\/www.hermitagtehillfarm.comPhone:  540 490 2609",
    "Phone_no":"5404902609",
    "Address":"[MAP]81 Livery LaneWaynesboro,",
    "Contact_person":"craig nargi",
    "Details":"Hermitage Hill is a beautiful farm situated in the foothills of the Blue Ridge. .\nWe offer an exclusive reception facility and premier horse boarding operation. Our reception room is climate controlled and measure at 4,000 sq feet. Beautiful views abound and we offer a patio area complete with a gas fireplace for chllier months. \nFor those looking to board, our facility offers 2 riding arenas, one with lights, round pen, hotwalker, hot and cold washbays, skydeck for viewing, wifi and a lounge area. \nVisit us online to learn more about this exclusive facility. Http:\/\/www.hermitagehillfarm.com"
  }
]